Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/bootloader/firmware/src/packs/PIC32WM_BZ6204_DFP/component/pps.h
/* -------- PPS_SCOM4P0R : (PPS Offset: 0x80) (R/W 32)  -------- */
#define PPS_SCOM4P0R_RESETVALUE               _UINT32_(0x00)                                       /*  (PPS_SCOM4P0R)   Reset Value */

#define PPS_SCOM4P0R_SCOM4P0_Pos              _UINT32_(0)                                          /* (PPS_SCOM4P0R) SERCOM4/PAD0 Position */
#define PPS_SCOM4P0R_SCOM4P0_Msk              (_UINT32_(0x1F) << PPS_SCOM4P0R_SCOM4P0_Pos)         /* (PPS_SCOM4P0R) SERCOM4/PAD0 Mask */
#define PPS_SCOM4P0R_SCOM4P0(value)           (PPS_SCOM4P0R_SCOM4P0_Msk & (_UINT32_(value) << PPS_SCOM4P0R_SCOM4P0_Pos)) /* Assignment of value for SCOM4P0 in the PPS_SCOM4P0R register */
#define   PPS_SCOM4P0R_SCOM4P0_OFF_Val        _UINT32_(0x0)                                        /* (PPS_SCOM4P0R) OFF  */
#define   PPS_SCOM4P0R_SCOM4P0_RPA1_Val       _UINT32_(0x1)                                        /* (PPS_SCOM4P0R) RPA1  */
#define   PPS_SCOM4P0R_SCOM4P0_RPA7_Val       _UINT32_(0x2)                                        /* (PPS_SCOM4P0R) RPA7  */
#define   PPS_SCOM4P0R_SCOM4P0_RPA12_Val      _UINT32_(0x3)                                        /* (PPS_SCOM4P0R) RPA12  */
#define   PPS_SCOM4P0R_SCOM4P0_RPB1_Val       _UINT32_(0x4)                                        /* (PPS_SCOM4P0R) RPB1  */
#define   PPS_SCOM4P0R_SCOM4P0_RPB7_Val       _UINT32_(0x5)                                        /* (PPS_SCOM4P0R) RPB7  */
#define   PPS_SCOM4P0R_SCOM4P0_RPC1_Val       _UINT32_(0x6)                                        /* (PPS_SCOM4P0R) RPC1  */
#define   PPS_SCOM4P0R_SCOM4P0_RPC7_Val       _UINT32_(0x7)                                        /* (PPS_SCOM4P0R) RPC7  */
#define   PPS_SCOM4P0R_SCOM4P0_RPD7_Val       _UINT32_(0x8)                                        /* (PPS_SCOM4P0R) RPD7  */
#define   PPS_SCOM4P0R_SCOM4P0_RPE1_Val       _UINT32_(0x9)                                        /* (PPS_SCOM4P0R) RPE1  */
#define   PPS_SCOM4P0R_SCOM4P0_RPA3_Val       _UINT32_(0xA)                                        /* (PPS_SCOM4P0R) RPA3  */
#define   PPS_SCOM4P0R_SCOM4P0_RPB2_Val       _UINT32_(0xB)                                        /* (PPS_SCOM4P0R) RPB2  */
#define   PPS_SCOM4P0R_SCOM4P0_RPC0_Val       _UINT32_(0xC)                                        /* (PPS_SCOM4P0R) RPC0  */
#define   PPS_SCOM4P0R_SCOM4P0_RPD4_Val       _UINT32_(0xD)                                        /* (PPS_SCOM4P0R) RPD4  */
#define   PPS_SCOM4P0R_SCOM4P0_RPE6_Val       _UINT32_(0xE)                                        /* (PPS_SCOM4P0R) RPE6  */
#define   PPS_SCOM4P0R_SCOM4P0_RPA4_Val       _UINT32_(0xF)                                        /* (PPS_SCOM4P0R) RPA4  */
#define   PPS_SCOM4P0R_SCOM4P0_RPA8_Val       _UINT32_(0x10)                                       /* (PPS_SCOM4P0R) RPA8  */
#define   PPS_SCOM4P0R_SCOM4P0_RPB12_Val      _UINT32_(0x11)                                       /* (PPS_SCOM4P0R) RPB12  */
#define   PPS_SCOM4P0R_SCOM4P0_RPB5_Val       _UINT32_(0x12)                                       /* (PPS_SCOM4P0R) RPB5  */
#define   PPS_SCOM4P0R_SCOM4P0_RPB9_Val       _UINT32_(0x13)                                       /* (PPS_SCOM4P0R) RPB9  */
#define   PPS_SCOM4P0R_SCOM4P0_RPB13_Val      _UINT32_(0x14)                                       /* (PPS_SCOM4P0R) RPB13  */
#define   PPS_SCOM4P0R_SCOM4P0_RPB0_Val       _UINT32_(0x15)                                       /* (PPS_SCOM4P0R) RPB0  */
#define   PPS_SCOM4P0R_SCOM4P0_RPB4_Val       _UINT32_(0x16)                                       /* (PPS_SCOM4P0R) RPB4  */
#define   PPS_SCOM4P0R_SCOM4P0_RPB8_Val       _UINT32_(0x17)                                       /* (PPS_SCOM4P0R) RPB8  */
#define   PPS_SCOM4P0R_SCOM4P0_RPA0_Val       _UINT32_(0x18)                                       /* (PPS_SCOM4P0R) RPA0  */
#define   PPS_SCOM4P0R_SCOM4P0_RPA11_Val      _UINT32_(0x19)                                       /* (PPS_SCOM4P0R) RPA11  */
#define PPS_SCOM4P0R_SCOM4P0_OFF              (PPS_SCOM4P0R_SCOM4P0_OFF_Val << PPS_SCOM4P0R_SCOM4P0_Pos) /* (PPS_SCOM4P0R) OFF Position */
#define PPS_SCOM4P0R_SCOM4P0_RPA1             (PPS_SCOM4P0R_SCOM4P0_RPA1_Val << PPS_SCOM4P0R_SCOM4P0_Pos) /* (PPS_SCOM4P0R) RPA1 Position */
#define PPS_SCOM4P0R_SCOM4P0_RPA7             (PPS_SCOM4P0R_SCOM4P0_RPA7_Val << PPS_SCOM4P0R_SCOM4P0_Pos) /* (PPS_SCOM4P0R) RPA7 Position */
#define PPS_SCOM4P0R_SCOM4P0_RPA12            (PPS_SCOM4P0R_SCOM4P0_RPA12_Val << PPS_SCOM4P0R_SCOM4P0_Pos) /* (PPS_SCOM4P0R) RPA12 Position */
#define PPS_SCOM4P0R_SCOM4P0_RPB1             (PPS_SCOM4P0R_SCOM4P0_RPB1_Val << PPS_SCOM4P0R_SCOM4P0_Pos) /* (PPS_SCOM4P0R) RPB1 Position */
#define PPS_SCOM4P0R_SCOM4P0_RPB7             (PPS_SCOM4P0R_SCOM4P0_RPB7_Val << PPS_SCOM4P0R_SCOM4P0_Pos) /* (PPS_SCOM4P0R) RPB7 Position */
#define PPS_SCOM4P0R_SCOM4P0_RPC1             (PPS_SCOM4P0R_SCOM4P0_RPC1_Val << PPS_SCOM4P0R_SCOM4P0_Pos) /* (PPS_SCOM4P0R) RPC1 Position */
#define PPS_SCOM4P0R_SCOM4P0_RPC7             (PPS_SCOM4P0R_SCOM4P0_RPC7_Val << PPS_SCOM4P0R_SCOM4P0_Pos) /* (PPS_SCOM4P0R) RPC7 Position */
#define PPS_SCOM4P0R_SCOM4P0_RPD7             (PPS_SCOM4P0R_SCOM4P0_RPD7_Val << PPS_SCOM4P0R_SCOM4P0_Pos) /* (PPS_SCOM4P0R) RPD7 Position */
#define PPS_SCOM4P0R_SCOM4P0_RPE1             (PPS_SCOM4P0R_SCOM4P0_RPE1_Val << PPS_SCOM4P0R_SCOM4P0_Pos) /* (PPS_SCOM4P0R) RPE1 Position */
#define PPS_SCOM4P0R_SCOM4P0_RPA3             (PPS_SCOM4P0R_SCOM4P0_RPA3_Val << PPS_SCOM4P0R_SCOM4P0_Pos) /* (PPS_SCOM4P0R) RPA3 Position */
#define PPS_SCOM4P0R_SCOM4P0_RPB2             (PPS_SCOM4P0R_SCOM4P0_RPB2_Val << PPS_SCOM4P0R_SCOM4P0_Pos) /* (PPS_SCOM4P0R) RPB2 Position */
#define PPS_SCOM4P0R_SCOM4P0_RPC0             (PPS_SCOM4P0R_SCOM4P0_RPC0_Val << PPS_SCOM4P0R_SCOM4P0_Pos) /* (PPS_SCOM4P0R) RPC0 Position */
#define PPS_SCOM4P0R_SCOM4P0_RPD4             (PPS_SCOM4P0R_SCOM4P0_RPD4_Val << PPS_SCOM4P0R_SCOM4P0_Pos) /* (PPS_SCOM4P0R) RPD4 Position */
#define PPS_SCOM4P0R_SCOM4P0_RPE6             (PPS_SCOM4P0R_SCOM4P0_RPE6_Val << PPS_SCOM4P0R_SCOM4P0_Pos) /* (PPS_SCOM4P0R) RPE6 Position */
#define PPS_SCOM4P0R_SCOM4P0_RPA4             (PPS_SCOM4P0R_SCOM4P0_RPA4_Val << PPS_SCOM4P0R_SCOM4P0_Pos) /* (PPS_SCOM4P0R) RPA4 Position */
#define PPS_SCOM4P0R_SCOM4P0_RPA8             (PPS_SCOM4P0R_SCOM4P0_RPA8_Val << PPS_SCOM4P0R_SCOM4P0_Pos) /* (PPS_SCOM4P0R) RPA8 Position */
#define PPS_SCOM4P0R_SCOM4P0_RPB12            (PPS_SCOM4P0R_SCOM4P0_RPB12_Val << PPS_SCOM4P0R_SCOM4P0_Pos) /* (PPS_SCOM4P0R) RPB12 Position */
#define PPS_SCOM4P0R_SCOM4P0_RPB5             (PPS_SCOM4P0R_SCOM4P0_RPB5_Val << PPS_SCOM4P0R_SCOM4P0_Pos) /* (PPS_SCOM4P0R) RPB5 Position */
#define PPS_SCOM4P0R_SCOM4P0_RPB9             (PPS_SCOM4P0R_SCOM4P0_RPB9_Val << PPS_SCOM4P0R_SCOM4P0_Pos) /* (PPS_SCOM4P0R) RPB9 Position */
#define PPS_SCOM4P0R_SCOM4P0_RPB13            (PPS_SCOM4P0R_SCOM4P0_RPB13_Val << PPS_SCOM4P0R_SCOM4P0_Pos) /* (PPS_SCOM4P0R) RPB13 Position */
#define PPS_SCOM4P0R_SCOM4P0_RPB0             (PPS_SCOM4P0R_SCOM4P0_RPB0_Val << PPS_SCOM4P0R_SCOM4P0_Pos) /* (PPS_SCOM4P0R) RPB0 Position */
#define PPS_SCOM4P0R_SCOM4P0_RPB4             (PPS_SCOM4P0R_SCOM4P0_RPB4_Val << PPS_SCOM4P0R_SCOM4P0_Pos) /* (PPS_SCOM4P0R) RPB4 Position */
#define PPS_SCOM4P0R_SCOM4P0_RPB8             (PPS_SCOM4P0R_SCOM4P0_RPB8_Val << PPS_SCOM4P0R_SCOM4P0_Pos) /* (PPS_SCOM4P0R) RPB8 Position */
#define PPS_SCOM4P0R_SCOM4P0_RPA0             (PPS_SCOM4P0R_SCOM4P0_RPA0_Val << PPS_SCOM4P0R_SCOM4P0_Pos) /* (PPS_SCOM4P0R) RPA0 Position */
#define PPS_SCOM4P0R_SCOM4P0_RPA11            (PPS_SCOM4P0R_SCOM4P0_RPA11_Val << PPS_SCOM4P0R_SCOM4P0_Pos) /* (PPS_SCOM4P0R) RPA11 Position */
#define PPS_SCOM4P0R_Msk                      _UINT32_(0x0000001F)                                 /* (PPS_SCOM4P0R) Register Mask  */


/* -------- PPS_SCOM4P1R : (PPS Offset: 0x84) (R/W 32)  -------- */
#define PPS_SCOM4P1R_RESETVALUE               _UINT32_(0x00)                                       /*  (PPS_SCOM4P1R)   Reset Value */

#define PPS_SCOM4P1R_SCOM4P1_Pos              _UINT32_(0)                                          /* (PPS_SCOM4P1R) SERCOM4/PAD1 Position */
#define PPS_SCOM4P1R_SCOM4P1_Msk              (_UINT32_(0x1F) << PPS_SCOM4P1R_SCOM4P1_Pos)         /* (PPS_SCOM4P1R) SERCOM4/PAD1 Mask */
#define PPS_SCOM4P1R_SCOM4P1(value)           (PPS_SCOM4P1R_SCOM4P1_Msk & (_UINT32_(value) << PPS_SCOM4P1R_SCOM4P1_Pos)) /* Assignment of value for SCOM4P1 in the PPS_SCOM4P1R register */
#define   PPS_SCOM4P1R_SCOM4P1_OFF_Val        _UINT32_(0x0)                                        /* (PPS_SCOM4P1R) OFF  */
#define   PPS_SCOM4P1R_SCOM4P1_RPA5_Val       _UINT32_(0x1)                                        /* (PPS_SCOM4P1R) RPA5  */
#define   PPS_SCOM4P1R_SCOM4P1_RPB5_Val       _UINT32_(0x2)                                        /* (PPS_SCOM4P1R) RPB5  */
#define   PPS_SCOM4P1R_SCOM4P1_RPB9_Val       _UINT32_(0x3)                                        /* (PPS_SCOM4P1R) RPB9  */
#define   PPS_SCOM4P1R_SCOM4P1_RPD5_Val       _UINT32_(0x4)                                        /* (PPS_SCOM4P1R) RPD5  */
#define   PPS_SCOM4P1R_SCOM4P1_RPE5_Val       _UINT32_(0x5)                                        /* (PPS_SCOM4P1R) RPE5  */
#define   PPS_SCOM4P1R_SCOM4P1_RPA3_Val       _UINT32_(0x6)                                        /* (PPS_SCOM4P1R) RPA3  */
#define   PPS_SCOM4P1R_SCOM4P1_RPA6_Val       _UINT32_(0x7)                                        /* (PPS_SCOM4P1R) RPA6  */
#define   PPS_SCOM4P1R_SCOM4P1_RPA7_Val       _UINT32_(0x8)                                        /* (PPS_SCOM4P1R) RPA7  */
#define   PPS_SCOM4P1R_SCOM4P1_RPB6_Val       _UINT32_(0x9)                                        /* (PPS_SCOM4P1R) RPB6  */
#define   PPS_SCOM4P1R_SCOM4P1_RPB8_Val       _UINT32_(0xA)                                        /* (PPS_SCOM4P1R) RPB8  */
#define PPS_SCOM4P1R_SCOM4P1_OFF              (PPS_SCOM4P1R_SCOM4P1_OFF_Val << PPS_SCOM4P1R_SCOM4P1_Pos) /* (PPS_SCOM4P1R) OFF Position */
#define PPS_SCOM4P1R_SCOM4P1_RPA5             (PPS_SCOM4P1R_SCOM4P1_RPA5_Val << PPS_SCOM4P1R_SCOM4P1_Pos) /* (PPS_SCOM4P1R) RPA5 Position */
#define PPS_SCOM4P1R_SCOM4P1_RPB5             (PPS_SCOM4P1R_SCOM4P1_RPB5_Val << PPS_SCOM4P1R_SCOM4P1_Pos) /* (PPS_SCOM4P1R) RPB5 Position */
#define PPS_SCOM4P1R_SCOM4P1_RPB9             (PPS_SCOM4P1R_SCOM4P1_RPB9_Val << PPS_SCOM4P1R_SCOM4P1_Pos) /* (PPS_SCOM4P1R) RPB9 Position */
#define PPS_SCOM4P1R_SCOM4P1_RPD5             (PPS_SCOM4P1R_SCOM4P1_RPD5_Val << PPS_SCOM4P1R_SCOM4P1_Pos) /* (PPS_SCOM4P1R) RPD5 Position */
#define PPS_SCOM4P1R_SCOM4P1_RPE5             (PPS_SCOM4P1R_SCOM4P1_RPE5_Val << PPS_SCOM4P1R_SCOM4P1_Pos) /* (PPS_SCOM4P1R) RPE5 Position */
#define PPS_SCOM4P1R_SCOM4P1_RPA3             (PPS_SCOM4P1R_SCOM4P1_RPA3_Val << PPS_SCOM4P1R_SCOM4P1_Pos) /* (PPS_SCOM4P1R) RPA3 Position */
#define PPS_SCOM4P1R_SCOM4P1_RPA6             (PPS_SCOM4P1R_SCOM4P1_RPA6_Val << PPS_SCOM4P1R_SCOM4P1_Pos) /* (PPS_SCOM4P1R) RPA6 Position */
#define PPS_SCOM4P1R_SCOM4P1_RPA7             (PPS_SCOM4P1R_SCOM4P1_RPA7_Val << PPS_SCOM4P1R_SCOM4P1_Pos) /* (PPS_SCOM4P1R) RPA7 Position */
#define PPS_SCOM4P1R_SCOM4P1_RPB6             (PPS_SCOM4P1R_SCOM4P1_RPB6_Val << PPS_SCOM4P1R_SCOM4P1_Pos) /* (PPS_SCOM4P1R) RPB6 Position */
#define PPS_SCOM4P1R_SCOM4P1_RPB8             (PPS_SCOM4P1R_SCOM4P1_RPB8_Val << PPS_SCOM4P1R_SCOM4P1_Pos) /* (PPS_SCOM4P1R) RPB8 Position */
#define PPS_SCOM4P1R_Msk                      _UINT32_(0x0000001F)                                 /* (PPS_SCOM4P1R) Register Mask  */


/* -------- PPS_SCOM4P2R : (PPS Offset: 0x88) (R/W 32)  -------- */
#define PPS_SCOM4P2R_RESETVALUE               _UINT32_(0x00)                                       /*  (PPS_SCOM4P2R)   Reset Value */

#define PPS_SCOM4P2R_SCOM4P2_Pos              _UINT32_(0)                                          /* (PPS_SCOM4P2R) SERCOM4/PAD2 Position */
#define PPS_SCOM4P2R_SCOM4P2_Msk              (_UINT32_(0x1F) << PPS_SCOM4P2R_SCOM4P2_Pos)         /* (PPS_SCOM4P2R) SERCOM4/PAD2 Mask */
#define PPS_SCOM4P2R_SCOM4P2(value)           (PPS_SCOM4P2R_SCOM4P2_Msk & (_UINT32_(value) << PPS_SCOM4P2R_SCOM4P2_Pos)) /* Assignment of value for SCOM4P2 in the PPS_SCOM4P2R register */
#define   PPS_SCOM4P2R_SCOM4P2_OFF_Val        _UINT32_(0x0)                                        /* (PPS_SCOM4P2R) OFF  */
#define   PPS_SCOM4P2R_SCOM4P2_RPA3_Val       _UINT32_(0x1)                                        /* (PPS_SCOM4P2R) RPA3  */
#define   PPS_SCOM4P2R_SCOM4P2_RPA9_Val       _UINT32_(0x2)                                        /* (PPS_SCOM4P2R) RPA9  */
#define   PPS_SCOM4P2R_SCOM4P2_RPA14_Val      _UINT32_(0x3)                                        /* (PPS_SCOM4P2R) RPA14  */
#define   PPS_SCOM4P2R_SCOM4P2_RPB3_Val       _UINT32_(0x4)                                        /* (PPS_SCOM4P2R) RPB3  */
#define   PPS_SCOM4P2R_SCOM4P2_RPC9_Val       _UINT32_(0x5)                                        /* (PPS_SCOM4P2R) RPC9  */
#define   PPS_SCOM4P2R_SCOM4P2_RPD3_Val       _UINT32_(0x6)                                        /* (PPS_SCOM4P2R) RPD3  */
#define   PPS_SCOM4P2R_SCOM4P2_RPE3_Val       _UINT32_(0x7)                                        /* (PPS_SCOM4P2R) RPE3  */
#define   PPS_SCOM4P2R_SCOM4P2_RPA0_Val       _UINT32_(0x8)                                        /* (PPS_SCOM4P2R) RPA0  */
#define   PPS_SCOM4P2R_SCOM4P2_RPB4_Val       _UINT32_(0x9)                                        /* (PPS_SCOM4P2R) RPB4  */
#define   PPS_SCOM4P2R_SCOM4P2_RPC7_Val       _UINT32_(0xA)                                        /* (PPS_SCOM4P2R) RPC7  */
#define   PPS_SCOM4P2R_SCOM4P2_RPD7_Val       _UINT32_(0xB)                                        /* (PPS_SCOM4P2R) RPD7  */
#define   PPS_SCOM4P2R_SCOM4P2_RPE1_Val       _UINT32_(0xC)                                        /* (PPS_SCOM4P2R) RPE1  */
#define   PPS_SCOM4P2R_SCOM4P2_RPA6_Val       _UINT32_(0xD)                                        /* (PPS_SCOM4P2R) RPA6  */
#define   PPS_SCOM4P2R_SCOM4P2_RPA10_Val      _UINT32_(0xE)                                        /* (PPS_SCOM4P2R) RPA10  */
#define   PPS_SCOM4P2R_SCOM4P2_RPB7_Val       _UINT32_(0xF)                                        /* (PPS_SCOM4P2R) RPB7  */
#define   PPS_SCOM4P2R_SCOM4P2_RPB11_Val      _UINT32_(0x10)                                       /* (PPS_SCOM4P2R) RPB11  */
#define   PPS_SCOM4P2R_SCOM4P2_RPA1_Val       _UINT32_(0x11)                                       /* (PPS_SCOM4P2R) RPA1  */
#define   PPS_SCOM4P2R_SCOM4P2_RPA5_Val       _UINT32_(0x12)                                       /* (PPS_SCOM4P2R) RPA5  */
#define   PPS_SCOM4P2R_SCOM4P2_RPA13_Val      _UINT32_(0x13)                                       /* (PPS_SCOM4P2R) RPA13  */
#define   PPS_SCOM4P2R_SCOM4P2_RPB2_Val       _UINT32_(0x14)                                       /* (PPS_SCOM4P2R) RPB2  */
#define   PPS_SCOM4P2R_SCOM4P2_RPB6_Val       _UINT32_(0x15)                                       /* (PPS_SCOM4P2R) RPB6  */
#define   PPS_SCOM4P2R_SCOM4P2_RPB10_Val      _UINT32_(0x16)                                       /* (PPS_SCOM4P2R) RPB10  */
#define   PPS_SCOM4P2R_SCOM4P2_RPA8_Val       _UINT32_(0x17)                                       /* (PPS_SCOM4P2R) RPA8  */
#define   PPS_SCOM4P2R_SCOM4P2_RPA2_Val       _UINT32_(0x18)                                       /* (PPS_SCOM4P2R) RPA2  */
#define PPS_SCOM4P2R_SCOM4P2_OFF              (PPS_SCOM4P2R_SCOM4P2_OFF_Val << PPS_SCOM4P2R_SCOM4P2_Pos) /* (PPS_SCOM4P2R) OFF Position */
#define PPS_SCOM4P2R_SCOM4P2_RPA3             (PPS_SCOM4P2R_SCOM4P2_RPA3_Val << PPS_SCOM4P2R_SCOM4P2_Pos) /* (PPS_SCOM4P2R) RPA3 Position */
#define PPS_SCOM4P2R_SCOM4P2_RPA9             (PPS_SCOM4P2R_SCOM4P2_RPA9_Val << PPS_SCOM4P2R_SCOM4P2_Pos) /* (PPS_SCOM4P2R) RPA9 Position */
#define PPS_SCOM4P2R_SCOM4P2_RPA14            (PPS_SCOM4P2R_SCOM4P2_RPA14_Val << PPS_SCOM4P2R_SCOM4P2_Pos) /* (PPS_SCOM4P2R) RPA14 Position */
#define PPS_SCOM4P2R_SCOM4P2_RPB3             (PPS_SCOM4P2R_SCOM4P2_RPB3_Val << PPS_SCOM4P2R_SCOM4P2_Pos) /* (PPS_SCOM4P2R) RPB3 Position */
#define PPS_SCOM4P2R_SCOM4P2_RPC9             (PPS_SCOM4P2R_SCOM4P2_RPC9_Val << PPS_SCOM4P2R_SCOM4P2_Pos) /* (PPS_SCOM4P2R) RPC9 Position */
#define PPS_SCOM4P2R_SCOM4P2_RPD3             (PPS_SCOM4P2R_SCOM4P2_RPD3_Val << PPS_SCOM4P2R_SCOM4P2_Pos) /* (PPS_SCOM4P2R) RPD3 Position */
#define PPS_SCOM4P2R_SCOM4P2_RPE3             (PPS_SCOM4P2R_SCOM4P2_RPE3_Val << PPS_SCOM4P2R_SCOM4P2_Pos) /* (PPS_SCOM4P2R) RPE3 Position */
#define PPS_SCOM4P2R_SCOM4P2_RPA0             (PPS_SCOM4P2R_SCOM4P2_RPA0_Val << PPS_SCOM4P2R_SCOM4P2_Pos) /* (PPS_SCOM4P2R) RPA0 Position */
#define PPS_SCOM4P2R_SCOM4P2_RPB4             (PPS_SCOM4P2R_SCOM4P2_RPB4_Val << PPS_SCOM4P2R_SCOM4P2_Pos) /* (PPS_SCOM4P2R) RPB4 Position */
#define PPS_SCOM4P2R_SCOM4P2_RPC7             (PPS_SCOM4P2R_SCOM4P2_RPC7_Val << PPS_SCOM4P2R_SCOM4P2_Pos) /* (PPS_SCOM4P2R) RPC7 Position */
#define PPS_SCOM4P2R_SCOM4P2_RPD7             (PPS_SCOM4P2R_SCOM4P2_RPD7_Val << PPS_SCOM4P2R_SCOM4P2_Pos) /* (PPS_SCOM4P2R) RPD7 Position */
#define PPS_SCOM4P2R_SCOM4P2_RPE1             (PPS_SCOM4P2R_SCOM4P2_RPE1_Val << PPS_SCOM4P2R_SCOM4P2_Pos) /* (PPS_SCOM4P2R) RPE1 Position */
#define PPS_SCOM4P2R_SCOM4P2_RPA6             (PPS_SCOM4P2R_SCOM4P2_RPA6_Val << PPS_SCOM4P2R_SCOM4P2_Pos) /* (PPS_SCOM4P2R) RPA6 Position */
#define PPS_SCOM4P2R_SCOM4P2_RPA10            (PPS_SCOM4P2R_SCOM4P2_RPA10_Val << PPS_SCOM4P2R_SCOM4P2_Pos) /* (PPS_SCOM4P2R) RPA10 Position */
#define PPS_SCOM4P2R_SCOM4P2_RPB7             (PPS_SCOM4P2R_SCOM4P2_RPB7_Val << PPS_SCOM4P2R_SCOM4P2_Pos) /* (PPS_SCOM4P2R) RPB7 Position */
#define PPS_SCOM4P2R_SCOM4P2_RPB11            (PPS_SCOM4P2R_SCOM4P2_RPB11_Val << PPS_SCOM4P2R_SCOM4P2_Pos) /* (PPS_SCOM4P2R) RPB11 Position */
#define PPS_SCOM4P2R_SCOM4P2_RPA1             (PPS_SCOM4P2R_SCOM4P2_RPA1_Val << PPS_SCOM4P2R_SCOM4P2_Pos) /* (PPS_SCOM4P2R) RPA1 Position */
#define PPS_SCOM4P2R_SCOM4P2_RPA5             (PPS_SCOM4P2R_SCOM4P2_RPA5_Val << PPS_SCOM4P2R_SCOM4P2_Pos) /* (PPS_SCOM4P2R) RPA5 Position */
#define PPS_SCOM4P2R_SCOM4P2_RPA13            (PPS_SCOM4P2R_SCOM4P2_RPA13_Val << PPS_SCOM4P2R_SCOM4P2_Pos) /* (PPS_SCOM4P2R) RPA13 Position */
#define PPS_SCOM4P2R_SCOM4P2_RPB2             (PPS_SCOM4P2R_SCOM4P2_RPB2_Val << PPS_SCOM4P2R_SCOM4P2_Pos) /* (PPS_SCOM4P2R) RPB2 Position */
#define PPS_SCOM4P2R_SCOM4P2_RPB6             (PPS_SCOM4P2R_SCOM4P2_RPB6_Val << PPS_SCOM4P2R_SCOM4P2_Pos) /* (PPS_SCOM4P2R) RPB6 Position */
#define PPS_SCOM4P2R_SCOM4P2_RPB10            (PPS_SCOM4P2R_SCOM4P2_RPB10_Val << PPS_SCOM4P2R_SCOM4P2_Pos) /* (PPS_SCOM4P2R) RPB10 Position */
#define PPS_SCOM4P2R_SCOM4P2_RPA8             (PPS_SCOM4P2R_SCOM4P2_RPA8_Val << PPS_SCOM4P2R_SCOM4P2_Pos) /* (PPS_SCOM4P2R) RPA8 Position */
#define PPS_SCOM4P2R_SCOM4P2_RPA2             (PPS_SCOM4P2R_SCOM4P2_RPA2_Val << PPS_SCOM4P2R_SCOM4P2_Pos) /* (PPS_SCOM4P2R) RPA2 Position */
#define PPS_SCOM4P2R_Msk                      _UINT32_(0x0000001F)                                 /* (PPS_SCOM4P2R) Register Mask  */


/* -------- PPS_SCOM4P3R : (PPS Offset: 0x8C) (R/W 32)  -------- */
#define PPS_SCOM4P3R_RESETVALUE               _UINT32_(0x00)                                       /*  (PPS_SCOM4P3R)   Reset Value */

