Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/bootloader/firmware/src/packs/PIC32WM_BZ6204_DFP/component/pps.h
#define PPS_CCLIN1R_CCLIN1_Pos                _UINT32_(0)                                          /* (PPS_CCLIN1R) CCL/IN1 Position */
#define PPS_CCLIN1R_CCLIN1_Msk                (_UINT32_(0x1F) << PPS_CCLIN1R_CCLIN1_Pos)           /* (PPS_CCLIN1R) CCL/IN1 Mask */
#define PPS_CCLIN1R_CCLIN1(value)             (PPS_CCLIN1R_CCLIN1_Msk & (_UINT32_(value) << PPS_CCLIN1R_CCLIN1_Pos)) /* Assignment of value for CCLIN1 in the PPS_CCLIN1R register */
#define   PPS_CCLIN1R_CCLIN1_OFF_Val          _UINT32_(0x0)                                        /* (PPS_CCLIN1R) OFF  */
#define   PPS_CCLIN1R_CCLIN1_RPA1_Val         _UINT32_(0x1)                                        /* (PPS_CCLIN1R) RPA1  */
#define   PPS_CCLIN1R_CCLIN1_RPA7_Val         _UINT32_(0x2)                                        /* (PPS_CCLIN1R) RPA7  */
#define   PPS_CCLIN1R_CCLIN1_RPA12_Val        _UINT32_(0x3)                                        /* (PPS_CCLIN1R) RPA12  */
#define   PPS_CCLIN1R_CCLIN1_RPB1_Val         _UINT32_(0x4)                                        /* (PPS_CCLIN1R) RPB1  */
#define   PPS_CCLIN1R_CCLIN1_RPB7_Val         _UINT32_(0x5)                                        /* (PPS_CCLIN1R) RPB7  */
#define   PPS_CCLIN1R_CCLIN1_RPC1_Val         _UINT32_(0x6)                                        /* (PPS_CCLIN1R) RPC1  */
#define   PPS_CCLIN1R_CCLIN1_RPC7_Val         _UINT32_(0x7)                                        /* (PPS_CCLIN1R) RPC7  */
#define   PPS_CCLIN1R_CCLIN1_RPD7_Val         _UINT32_(0x8)                                        /* (PPS_CCLIN1R) RPD7  */
#define   PPS_CCLIN1R_CCLIN1_RPE1_Val         _UINT32_(0x9)                                        /* (PPS_CCLIN1R) RPE1  */
#define   PPS_CCLIN1R_CCLIN1_RPA3_Val         _UINT32_(0xA)                                        /* (PPS_CCLIN1R) RPA3  */
#define   PPS_CCLIN1R_CCLIN1_RPB2_Val         _UINT32_(0xB)                                        /* (PPS_CCLIN1R) RPB2  */
#define   PPS_CCLIN1R_CCLIN1_RPC0_Val         _UINT32_(0xC)                                        /* (PPS_CCLIN1R) RPC0  */
#define   PPS_CCLIN1R_CCLIN1_RPD4_Val         _UINT32_(0xD)                                        /* (PPS_CCLIN1R) RPD4  */
#define   PPS_CCLIN1R_CCLIN1_RPE6_Val         _UINT32_(0xE)                                        /* (PPS_CCLIN1R) RPE6  */
#define   PPS_CCLIN1R_CCLIN1_RPA4_Val         _UINT32_(0xF)                                        /* (PPS_CCLIN1R) RPA4  */
#define   PPS_CCLIN1R_CCLIN1_RPA8_Val         _UINT32_(0x10)                                       /* (PPS_CCLIN1R) RPA8  */
#define   PPS_CCLIN1R_CCLIN1_RPB12_Val        _UINT32_(0x11)                                       /* (PPS_CCLIN1R) RPB12  */
#define   PPS_CCLIN1R_CCLIN1_RPB5_Val         _UINT32_(0x12)                                       /* (PPS_CCLIN1R) RPB5  */
#define   PPS_CCLIN1R_CCLIN1_RPB9_Val         _UINT32_(0x13)                                       /* (PPS_CCLIN1R) RPB9  */
#define   PPS_CCLIN1R_CCLIN1_RPB13_Val        _UINT32_(0x14)                                       /* (PPS_CCLIN1R) RPB13  */
#define   PPS_CCLIN1R_CCLIN1_RPB0_Val         _UINT32_(0x15)                                       /* (PPS_CCLIN1R) RPB0  */
#define   PPS_CCLIN1R_CCLIN1_RPB4_Val         _UINT32_(0x16)                                       /* (PPS_CCLIN1R) RPB4  */
#define   PPS_CCLIN1R_CCLIN1_RPB8_Val         _UINT32_(0x17)                                       /* (PPS_CCLIN1R) RPB8  */
#define   PPS_CCLIN1R_CCLIN1_RPA0_Val         _UINT32_(0x18)                                       /* (PPS_CCLIN1R) RPA0  */
#define   PPS_CCLIN1R_CCLIN1_RPA11_Val        _UINT32_(0x19)                                       /* (PPS_CCLIN1R) RPA11  */
#define PPS_CCLIN1R_CCLIN1_OFF                (PPS_CCLIN1R_CCLIN1_OFF_Val << PPS_CCLIN1R_CCLIN1_Pos) /* (PPS_CCLIN1R) OFF Position */
#define PPS_CCLIN1R_CCLIN1_RPA1               (PPS_CCLIN1R_CCLIN1_RPA1_Val << PPS_CCLIN1R_CCLIN1_Pos) /* (PPS_CCLIN1R) RPA1 Position */
#define PPS_CCLIN1R_CCLIN1_RPA7               (PPS_CCLIN1R_CCLIN1_RPA7_Val << PPS_CCLIN1R_CCLIN1_Pos) /* (PPS_CCLIN1R) RPA7 Position */
#define PPS_CCLIN1R_CCLIN1_RPA12              (PPS_CCLIN1R_CCLIN1_RPA12_Val << PPS_CCLIN1R_CCLIN1_Pos) /* (PPS_CCLIN1R) RPA12 Position */
#define PPS_CCLIN1R_CCLIN1_RPB1               (PPS_CCLIN1R_CCLIN1_RPB1_Val << PPS_CCLIN1R_CCLIN1_Pos) /* (PPS_CCLIN1R) RPB1 Position */
#define PPS_CCLIN1R_CCLIN1_RPB7               (PPS_CCLIN1R_CCLIN1_RPB7_Val << PPS_CCLIN1R_CCLIN1_Pos) /* (PPS_CCLIN1R) RPB7 Position */
#define PPS_CCLIN1R_CCLIN1_RPC1               (PPS_CCLIN1R_CCLIN1_RPC1_Val << PPS_CCLIN1R_CCLIN1_Pos) /* (PPS_CCLIN1R) RPC1 Position */
#define PPS_CCLIN1R_CCLIN1_RPC7               (PPS_CCLIN1R_CCLIN1_RPC7_Val << PPS_CCLIN1R_CCLIN1_Pos) /* (PPS_CCLIN1R) RPC7 Position */
#define PPS_CCLIN1R_CCLIN1_RPD7               (PPS_CCLIN1R_CCLIN1_RPD7_Val << PPS_CCLIN1R_CCLIN1_Pos) /* (PPS_CCLIN1R) RPD7 Position */
#define PPS_CCLIN1R_CCLIN1_RPE1               (PPS_CCLIN1R_CCLIN1_RPE1_Val << PPS_CCLIN1R_CCLIN1_Pos) /* (PPS_CCLIN1R) RPE1 Position */
#define PPS_CCLIN1R_CCLIN1_RPA3               (PPS_CCLIN1R_CCLIN1_RPA3_Val << PPS_CCLIN1R_CCLIN1_Pos) /* (PPS_CCLIN1R) RPA3 Position */
#define PPS_CCLIN1R_CCLIN1_RPB2               (PPS_CCLIN1R_CCLIN1_RPB2_Val << PPS_CCLIN1R_CCLIN1_Pos) /* (PPS_CCLIN1R) RPB2 Position */
#define PPS_CCLIN1R_CCLIN1_RPC0               (PPS_CCLIN1R_CCLIN1_RPC0_Val << PPS_CCLIN1R_CCLIN1_Pos) /* (PPS_CCLIN1R) RPC0 Position */
#define PPS_CCLIN1R_CCLIN1_RPD4               (PPS_CCLIN1R_CCLIN1_RPD4_Val << PPS_CCLIN1R_CCLIN1_Pos) /* (PPS_CCLIN1R) RPD4 Position */
#define PPS_CCLIN1R_CCLIN1_RPE6               (PPS_CCLIN1R_CCLIN1_RPE6_Val << PPS_CCLIN1R_CCLIN1_Pos) /* (PPS_CCLIN1R) RPE6 Position */
#define PPS_CCLIN1R_CCLIN1_RPA4               (PPS_CCLIN1R_CCLIN1_RPA4_Val << PPS_CCLIN1R_CCLIN1_Pos) /* (PPS_CCLIN1R) RPA4 Position */
#define PPS_CCLIN1R_CCLIN1_RPA8               (PPS_CCLIN1R_CCLIN1_RPA8_Val << PPS_CCLIN1R_CCLIN1_Pos) /* (PPS_CCLIN1R) RPA8 Position */
#define PPS_CCLIN1R_CCLIN1_RPB12              (PPS_CCLIN1R_CCLIN1_RPB12_Val << PPS_CCLIN1R_CCLIN1_Pos) /* (PPS_CCLIN1R) RPB12 Position */
#define PPS_CCLIN1R_CCLIN1_RPB5               (PPS_CCLIN1R_CCLIN1_RPB5_Val << PPS_CCLIN1R_CCLIN1_Pos) /* (PPS_CCLIN1R) RPB5 Position */
#define PPS_CCLIN1R_CCLIN1_RPB9               (PPS_CCLIN1R_CCLIN1_RPB9_Val << PPS_CCLIN1R_CCLIN1_Pos) /* (PPS_CCLIN1R) RPB9 Position */
#define PPS_CCLIN1R_CCLIN1_RPB13              (PPS_CCLIN1R_CCLIN1_RPB13_Val << PPS_CCLIN1R_CCLIN1_Pos) /* (PPS_CCLIN1R) RPB13 Position */
#define PPS_CCLIN1R_CCLIN1_RPB0               (PPS_CCLIN1R_CCLIN1_RPB0_Val << PPS_CCLIN1R_CCLIN1_Pos) /* (PPS_CCLIN1R) RPB0 Position */
#define PPS_CCLIN1R_CCLIN1_RPB4               (PPS_CCLIN1R_CCLIN1_RPB4_Val << PPS_CCLIN1R_CCLIN1_Pos) /* (PPS_CCLIN1R) RPB4 Position */
#define PPS_CCLIN1R_CCLIN1_RPB8               (PPS_CCLIN1R_CCLIN1_RPB8_Val << PPS_CCLIN1R_CCLIN1_Pos) /* (PPS_CCLIN1R) RPB8 Position */
#define PPS_CCLIN1R_CCLIN1_RPA0               (PPS_CCLIN1R_CCLIN1_RPA0_Val << PPS_CCLIN1R_CCLIN1_Pos) /* (PPS_CCLIN1R) RPA0 Position */
#define PPS_CCLIN1R_CCLIN1_RPA11              (PPS_CCLIN1R_CCLIN1_RPA11_Val << PPS_CCLIN1R_CCLIN1_Pos) /* (PPS_CCLIN1R) RPA11 Position */
#define PPS_CCLIN1R_Msk                       _UINT32_(0x0000001F)                                 /* (PPS_CCLIN1R) Register Mask  */


