Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/bootloader/firmware/src/packs/PIC32WM_BZ6204_DFP/component/pps.h
#define PPS_CCLIN4R_CCLIN4_Pos                _UINT32_(0)                                          /* (PPS_CCLIN4R) CCL/IN4 Position */
#define PPS_CCLIN4R_CCLIN4_Msk                (_UINT32_(0x1F) << PPS_CCLIN4R_CCLIN4_Pos)           /* (PPS_CCLIN4R) CCL/IN4 Mask */
#define PPS_CCLIN4R_CCLIN4(value)             (PPS_CCLIN4R_CCLIN4_Msk & (_UINT32_(value) << PPS_CCLIN4R_CCLIN4_Pos)) /* Assignment of value for CCLIN4 in the PPS_CCLIN4R register */
#define   PPS_CCLIN4R_CCLIN4_OFF_Val          _UINT32_(0x0)                                        /* (PPS_CCLIN4R) OFF  */
#define   PPS_CCLIN4R_CCLIN4_RPA1_Val         _UINT32_(0x1)                                        /* (PPS_CCLIN4R) RPA1  */
#define   PPS_CCLIN4R_CCLIN4_RPA7_Val         _UINT32_(0x2)                                        /* (PPS_CCLIN4R) RPA7  */
#define   PPS_CCLIN4R_CCLIN4_RPA12_Val        _UINT32_(0x3)                                        /* (PPS_CCLIN4R) RPA12  */
#define   PPS_CCLIN4R_CCLIN4_RPB1_Val         _UINT32_(0x4)                                        /* (PPS_CCLIN4R) RPB1  */
#define   PPS_CCLIN4R_CCLIN4_RPB7_Val         _UINT32_(0x5)                                        /* (PPS_CCLIN4R) RPB7  */
#define   PPS_CCLIN4R_CCLIN4_RPC1_Val         _UINT32_(0x6)                                        /* (PPS_CCLIN4R) RPC1  */
#define   PPS_CCLIN4R_CCLIN4_RPC7_Val         _UINT32_(0x7)                                        /* (PPS_CCLIN4R) RPC7  */
#define   PPS_CCLIN4R_CCLIN4_RPD7_Val         _UINT32_(0x8)                                        /* (PPS_CCLIN4R) RPD7  */
#define   PPS_CCLIN4R_CCLIN4_RPE1_Val         _UINT32_(0x9)                                        /* (PPS_CCLIN4R) RPE1  */
#define   PPS_CCLIN4R_CCLIN4_RPA3_Val         _UINT32_(0xA)                                        /* (PPS_CCLIN4R) RPA3  */
#define   PPS_CCLIN4R_CCLIN4_RPB2_Val         _UINT32_(0xB)                                        /* (PPS_CCLIN4R) RPB2  */
#define   PPS_CCLIN4R_CCLIN4_RPC0_Val         _UINT32_(0xC)                                        /* (PPS_CCLIN4R) RPC0  */
#define   PPS_CCLIN4R_CCLIN4_RPD4_Val         _UINT32_(0xD)                                        /* (PPS_CCLIN4R) RPD4  */
#define   PPS_CCLIN4R_CCLIN4_RPE6_Val         _UINT32_(0xE)                                        /* (PPS_CCLIN4R) RPE6  */
#define   PPS_CCLIN4R_CCLIN4_RPA4_Val         _UINT32_(0xF)                                        /* (PPS_CCLIN4R) RPA4  */
#define   PPS_CCLIN4R_CCLIN4_RPA8_Val         _UINT32_(0x10)                                       /* (PPS_CCLIN4R) RPA8  */
#define   PPS_CCLIN4R_CCLIN4_RPB12_Val        _UINT32_(0x11)                                       /* (PPS_CCLIN4R) RPB12  */
#define   PPS_CCLIN4R_CCLIN4_RPB5_Val         _UINT32_(0x12)                                       /* (PPS_CCLIN4R) RPB5  */
#define   PPS_CCLIN4R_CCLIN4_RPB9_Val         _UINT32_(0x13)                                       /* (PPS_CCLIN4R) RPB9  */
#define   PPS_CCLIN4R_CCLIN4_RPB13_Val        _UINT32_(0x14)                                       /* (PPS_CCLIN4R) RPB13  */
#define   PPS_CCLIN4R_CCLIN4_RPB0_Val         _UINT32_(0x15)                                       /* (PPS_CCLIN4R) RPB0  */
#define   PPS_CCLIN4R_CCLIN4_RPB4_Val         _UINT32_(0x16)                                       /* (PPS_CCLIN4R) RPB4  */
#define   PPS_CCLIN4R_CCLIN4_RPB8_Val         _UINT32_(0x17)                                       /* (PPS_CCLIN4R) RPB8  */
#define   PPS_CCLIN4R_CCLIN4_RPA0_Val         _UINT32_(0x18)                                       /* (PPS_CCLIN4R) RPA0  */
#define   PPS_CCLIN4R_CCLIN4_RPA11_Val        _UINT32_(0x19)                                       /* (PPS_CCLIN4R) RPA11  */
#define PPS_CCLIN4R_CCLIN4_OFF                (PPS_CCLIN4R_CCLIN4_OFF_Val << PPS_CCLIN4R_CCLIN4_Pos) /* (PPS_CCLIN4R) OFF Position */
#define PPS_CCLIN4R_CCLIN4_RPA1               (PPS_CCLIN4R_CCLIN4_RPA1_Val << PPS_CCLIN4R_CCLIN4_Pos) /* (PPS_CCLIN4R) RPA1 Position */
#define PPS_CCLIN4R_CCLIN4_RPA7               (PPS_CCLIN4R_CCLIN4_RPA7_Val << PPS_CCLIN4R_CCLIN4_Pos) /* (PPS_CCLIN4R) RPA7 Position */
#define PPS_CCLIN4R_CCLIN4_RPA12              (PPS_CCLIN4R_CCLIN4_RPA12_Val << PPS_CCLIN4R_CCLIN4_Pos) /* (PPS_CCLIN4R) RPA12 Position */
#define PPS_CCLIN4R_CCLIN4_RPB1               (PPS_CCLIN4R_CCLIN4_RPB1_Val << PPS_CCLIN4R_CCLIN4_Pos) /* (PPS_CCLIN4R) RPB1 Position */
#define PPS_CCLIN4R_CCLIN4_RPB7               (PPS_CCLIN4R_CCLIN4_RPB7_Val << PPS_CCLIN4R_CCLIN4_Pos) /* (PPS_CCLIN4R) RPB7 Position */
#define PPS_CCLIN4R_CCLIN4_RPC1               (PPS_CCLIN4R_CCLIN4_RPC1_Val << PPS_CCLIN4R_CCLIN4_Pos) /* (PPS_CCLIN4R) RPC1 Position */
#define PPS_CCLIN4R_CCLIN4_RPC7               (PPS_CCLIN4R_CCLIN4_RPC7_Val << PPS_CCLIN4R_CCLIN4_Pos) /* (PPS_CCLIN4R) RPC7 Position */
#define PPS_CCLIN4R_CCLIN4_RPD7               (PPS_CCLIN4R_CCLIN4_RPD7_Val << PPS_CCLIN4R_CCLIN4_Pos) /* (PPS_CCLIN4R) RPD7 Position */
#define PPS_CCLIN4R_CCLIN4_RPE1               (PPS_CCLIN4R_CCLIN4_RPE1_Val << PPS_CCLIN4R_CCLIN4_Pos) /* (PPS_CCLIN4R) RPE1 Position */
#define PPS_CCLIN4R_CCLIN4_RPA3               (PPS_CCLIN4R_CCLIN4_RPA3_Val << PPS_CCLIN4R_CCLIN4_Pos) /* (PPS_CCLIN4R) RPA3 Position */
#define PPS_CCLIN4R_CCLIN4_RPB2               (PPS_CCLIN4R_CCLIN4_RPB2_Val << PPS_CCLIN4R_CCLIN4_Pos) /* (PPS_CCLIN4R) RPB2 Position */
#define PPS_CCLIN4R_CCLIN4_RPC0               (PPS_CCLIN4R_CCLIN4_RPC0_Val << PPS_CCLIN4R_CCLIN4_Pos) /* (PPS_CCLIN4R) RPC0 Position */
#define PPS_CCLIN4R_CCLIN4_RPD4               (PPS_CCLIN4R_CCLIN4_RPD4_Val << PPS_CCLIN4R_CCLIN4_Pos) /* (PPS_CCLIN4R) RPD4 Position */
#define PPS_CCLIN4R_CCLIN4_RPE6               (PPS_CCLIN4R_CCLIN4_RPE6_Val << PPS_CCLIN4R_CCLIN4_Pos) /* (PPS_CCLIN4R) RPE6 Position */
#define PPS_CCLIN4R_CCLIN4_RPA4               (PPS_CCLIN4R_CCLIN4_RPA4_Val << PPS_CCLIN4R_CCLIN4_Pos) /* (PPS_CCLIN4R) RPA4 Position */
#define PPS_CCLIN4R_CCLIN4_RPA8               (PPS_CCLIN4R_CCLIN4_RPA8_Val << PPS_CCLIN4R_CCLIN4_Pos) /* (PPS_CCLIN4R) RPA8 Position */
#define PPS_CCLIN4R_CCLIN4_RPB12              (PPS_CCLIN4R_CCLIN4_RPB12_Val << PPS_CCLIN4R_CCLIN4_Pos) /* (PPS_CCLIN4R) RPB12 Position */
#define PPS_CCLIN4R_CCLIN4_RPB5               (PPS_CCLIN4R_CCLIN4_RPB5_Val << PPS_CCLIN4R_CCLIN4_Pos) /* (PPS_CCLIN4R) RPB5 Position */
#define PPS_CCLIN4R_CCLIN4_RPB9               (PPS_CCLIN4R_CCLIN4_RPB9_Val << PPS_CCLIN4R_CCLIN4_Pos) /* (PPS_CCLIN4R) RPB9 Position */
#define PPS_CCLIN4R_CCLIN4_RPB13              (PPS_CCLIN4R_CCLIN4_RPB13_Val << PPS_CCLIN4R_CCLIN4_Pos) /* (PPS_CCLIN4R) RPB13 Position */
#define PPS_CCLIN4R_CCLIN4_RPB0               (PPS_CCLIN4R_CCLIN4_RPB0_Val << PPS_CCLIN4R_CCLIN4_Pos) /* (PPS_CCLIN4R) RPB0 Position */
#define PPS_CCLIN4R_CCLIN4_RPB4               (PPS_CCLIN4R_CCLIN4_RPB4_Val << PPS_CCLIN4R_CCLIN4_Pos) /* (PPS_CCLIN4R) RPB4 Position */
#define PPS_CCLIN4R_CCLIN4_RPB8               (PPS_CCLIN4R_CCLIN4_RPB8_Val << PPS_CCLIN4R_CCLIN4_Pos) /* (PPS_CCLIN4R) RPB8 Position */
#define PPS_CCLIN4R_CCLIN4_RPA0               (PPS_CCLIN4R_CCLIN4_RPA0_Val << PPS_CCLIN4R_CCLIN4_Pos) /* (PPS_CCLIN4R) RPA0 Position */
#define PPS_CCLIN4R_CCLIN4_RPA11              (PPS_CCLIN4R_CCLIN4_RPA11_Val << PPS_CCLIN4R_CCLIN4_Pos) /* (PPS_CCLIN4R) RPA11 Position */
#define PPS_CCLIN4R_Msk                       _UINT32_(0x0000001F)                                 /* (PPS_CCLIN4R) Register Mask  */


