Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/bootloader/firmware/src/packs/PIC32WM_BZ6204_DFP/component/pps.h
/* -------- PPS_TC8WO1G2R : (PPS Offset: 0x154) (R/W 32)  -------- */
#define PPS_TC8WO1G2R_RESETVALUE              _UINT32_(0x00)                                       /*  (PPS_TC8WO1G2R)   Reset Value */

#define PPS_TC8WO1G2R_TC8WO1G2_Pos            _UINT32_(0)                                          /* (PPS_TC8WO1G2R) TC8/WO1G2 Position */
#define PPS_TC8WO1G2R_TC8WO1G2_Msk            (_UINT32_(0x1F) << PPS_TC8WO1G2R_TC8WO1G2_Pos)       /* (PPS_TC8WO1G2R) TC8/WO1G2 Mask */
#define PPS_TC8WO1G2R_TC8WO1G2(value)         (PPS_TC8WO1G2R_TC8WO1G2_Msk & (_UINT32_(value) << PPS_TC8WO1G2R_TC8WO1G2_Pos)) /* Assignment of value for TC8WO1G2 in the PPS_TC8WO1G2R register */
#define   PPS_TC8WO1G2R_TC8WO1G2_OFF_Val      _UINT32_(0x0)                                        /* (PPS_TC8WO1G2R) OFF  */
#define   PPS_TC8WO1G2R_TC8WO1G2_RPA1_Val     _UINT32_(0x1)                                        /* (PPS_TC8WO1G2R) RPA1  */
#define   PPS_TC8WO1G2R_TC8WO1G2_RPA7_Val     _UINT32_(0x2)                                        /* (PPS_TC8WO1G2R) RPA7  */
#define   PPS_TC8WO1G2R_TC8WO1G2_RPA12_Val    _UINT32_(0x3)                                        /* (PPS_TC8WO1G2R) RPA12  */
#define   PPS_TC8WO1G2R_TC8WO1G2_RPB1_Val     _UINT32_(0x4)                                        /* (PPS_TC8WO1G2R) RPB1  */
#define   PPS_TC8WO1G2R_TC8WO1G2_RPB7_Val     _UINT32_(0x5)                                        /* (PPS_TC8WO1G2R) RPB7  */
#define   PPS_TC8WO1G2R_TC8WO1G2_RPC1_Val     _UINT32_(0x6)                                        /* (PPS_TC8WO1G2R) RPC1  */
#define   PPS_TC8WO1G2R_TC8WO1G2_RPC7_Val     _UINT32_(0x7)                                        /* (PPS_TC8WO1G2R) RPC7  */
#define   PPS_TC8WO1G2R_TC8WO1G2_RPD7_Val     _UINT32_(0x8)                                        /* (PPS_TC8WO1G2R) RPD7  */
#define   PPS_TC8WO1G2R_TC8WO1G2_RPE1_Val     _UINT32_(0x9)                                        /* (PPS_TC8WO1G2R) RPE1  */
#define   PPS_TC8WO1G2R_TC8WO1G2_RPA3_Val     _UINT32_(0xA)                                        /* (PPS_TC8WO1G2R) RPA3  */
#define   PPS_TC8WO1G2R_TC8WO1G2_RPB2_Val     _UINT32_(0xB)                                        /* (PPS_TC8WO1G2R) RPB2  */
#define   PPS_TC8WO1G2R_TC8WO1G2_RPC0_Val     _UINT32_(0xC)                                        /* (PPS_TC8WO1G2R) RPC0  */
#define   PPS_TC8WO1G2R_TC8WO1G2_RPD4_Val     _UINT32_(0xD)                                        /* (PPS_TC8WO1G2R) RPD4  */
#define   PPS_TC8WO1G2R_TC8WO1G2_RPE6_Val     _UINT32_(0xE)                                        /* (PPS_TC8WO1G2R) RPE6  */
#define   PPS_TC8WO1G2R_TC8WO1G2_RPA4_Val     _UINT32_(0xF)                                        /* (PPS_TC8WO1G2R) RPA4  */
#define   PPS_TC8WO1G2R_TC8WO1G2_RPA8_Val     _UINT32_(0x10)                                       /* (PPS_TC8WO1G2R) RPA8  */
#define   PPS_TC8WO1G2R_TC8WO1G2_RPB12_Val    _UINT32_(0x11)                                       /* (PPS_TC8WO1G2R) RPB12  */
#define   PPS_TC8WO1G2R_TC8WO1G2_RPB5_Val     _UINT32_(0x12)                                       /* (PPS_TC8WO1G2R) RPB5  */
#define   PPS_TC8WO1G2R_TC8WO1G2_RPB9_Val     _UINT32_(0x13)                                       /* (PPS_TC8WO1G2R) RPB9  */
#define   PPS_TC8WO1G2R_TC8WO1G2_RPB13_Val    _UINT32_(0x14)                                       /* (PPS_TC8WO1G2R) RPB13  */
#define   PPS_TC8WO1G2R_TC8WO1G2_RPB0_Val     _UINT32_(0x15)                                       /* (PPS_TC8WO1G2R) RPB0  */
#define   PPS_TC8WO1G2R_TC8WO1G2_RPB4_Val     _UINT32_(0x16)                                       /* (PPS_TC8WO1G2R) RPB4  */
#define   PPS_TC8WO1G2R_TC8WO1G2_RPB8_Val     _UINT32_(0x17)                                       /* (PPS_TC8WO1G2R) RPB8  */
#define   PPS_TC8WO1G2R_TC8WO1G2_RPA0_Val     _UINT32_(0x18)                                       /* (PPS_TC8WO1G2R) RPA0  */
#define   PPS_TC8WO1G2R_TC8WO1G2_RPA11_Val    _UINT32_(0x19)                                       /* (PPS_TC8WO1G2R) RPA11  */
#define PPS_TC8WO1G2R_TC8WO1G2_OFF            (PPS_TC8WO1G2R_TC8WO1G2_OFF_Val << PPS_TC8WO1G2R_TC8WO1G2_Pos) /* (PPS_TC8WO1G2R) OFF Position */
#define PPS_TC8WO1G2R_TC8WO1G2_RPA1           (PPS_TC8WO1G2R_TC8WO1G2_RPA1_Val << PPS_TC8WO1G2R_TC8WO1G2_Pos) /* (PPS_TC8WO1G2R) RPA1 Position */
#define PPS_TC8WO1G2R_TC8WO1G2_RPA7           (PPS_TC8WO1G2R_TC8WO1G2_RPA7_Val << PPS_TC8WO1G2R_TC8WO1G2_Pos) /* (PPS_TC8WO1G2R) RPA7 Position */
#define PPS_TC8WO1G2R_TC8WO1G2_RPA12          (PPS_TC8WO1G2R_TC8WO1G2_RPA12_Val << PPS_TC8WO1G2R_TC8WO1G2_Pos) /* (PPS_TC8WO1G2R) RPA12 Position */
#define PPS_TC8WO1G2R_TC8WO1G2_RPB1           (PPS_TC8WO1G2R_TC8WO1G2_RPB1_Val << PPS_TC8WO1G2R_TC8WO1G2_Pos) /* (PPS_TC8WO1G2R) RPB1 Position */
#define PPS_TC8WO1G2R_TC8WO1G2_RPB7           (PPS_TC8WO1G2R_TC8WO1G2_RPB7_Val << PPS_TC8WO1G2R_TC8WO1G2_Pos) /* (PPS_TC8WO1G2R) RPB7 Position */
#define PPS_TC8WO1G2R_TC8WO1G2_RPC1           (PPS_TC8WO1G2R_TC8WO1G2_RPC1_Val << PPS_TC8WO1G2R_TC8WO1G2_Pos) /* (PPS_TC8WO1G2R) RPC1 Position */
#define PPS_TC8WO1G2R_TC8WO1G2_RPC7           (PPS_TC8WO1G2R_TC8WO1G2_RPC7_Val << PPS_TC8WO1G2R_TC8WO1G2_Pos) /* (PPS_TC8WO1G2R) RPC7 Position */
#define PPS_TC8WO1G2R_TC8WO1G2_RPD7           (PPS_TC8WO1G2R_TC8WO1G2_RPD7_Val << PPS_TC8WO1G2R_TC8WO1G2_Pos) /* (PPS_TC8WO1G2R) RPD7 Position */
#define PPS_TC8WO1G2R_TC8WO1G2_RPE1           (PPS_TC8WO1G2R_TC8WO1G2_RPE1_Val << PPS_TC8WO1G2R_TC8WO1G2_Pos) /* (PPS_TC8WO1G2R) RPE1 Position */
#define PPS_TC8WO1G2R_TC8WO1G2_RPA3           (PPS_TC8WO1G2R_TC8WO1G2_RPA3_Val << PPS_TC8WO1G2R_TC8WO1G2_Pos) /* (PPS_TC8WO1G2R) RPA3 Position */
#define PPS_TC8WO1G2R_TC8WO1G2_RPB2           (PPS_TC8WO1G2R_TC8WO1G2_RPB2_Val << PPS_TC8WO1G2R_TC8WO1G2_Pos) /* (PPS_TC8WO1G2R) RPB2 Position */
#define PPS_TC8WO1G2R_TC8WO1G2_RPC0           (PPS_TC8WO1G2R_TC8WO1G2_RPC0_Val << PPS_TC8WO1G2R_TC8WO1G2_Pos) /* (PPS_TC8WO1G2R) RPC0 Position */
#define PPS_TC8WO1G2R_TC8WO1G2_RPD4           (PPS_TC8WO1G2R_TC8WO1G2_RPD4_Val << PPS_TC8WO1G2R_TC8WO1G2_Pos) /* (PPS_TC8WO1G2R) RPD4 Position */
#define PPS_TC8WO1G2R_TC8WO1G2_RPE6           (PPS_TC8WO1G2R_TC8WO1G2_RPE6_Val << PPS_TC8WO1G2R_TC8WO1G2_Pos) /* (PPS_TC8WO1G2R) RPE6 Position */
#define PPS_TC8WO1G2R_TC8WO1G2_RPA4           (PPS_TC8WO1G2R_TC8WO1G2_RPA4_Val << PPS_TC8WO1G2R_TC8WO1G2_Pos) /* (PPS_TC8WO1G2R) RPA4 Position */
#define PPS_TC8WO1G2R_TC8WO1G2_RPA8           (PPS_TC8WO1G2R_TC8WO1G2_RPA8_Val << PPS_TC8WO1G2R_TC8WO1G2_Pos) /* (PPS_TC8WO1G2R) RPA8 Position */
#define PPS_TC8WO1G2R_TC8WO1G2_RPB12          (PPS_TC8WO1G2R_TC8WO1G2_RPB12_Val << PPS_TC8WO1G2R_TC8WO1G2_Pos) /* (PPS_TC8WO1G2R) RPB12 Position */
#define PPS_TC8WO1G2R_TC8WO1G2_RPB5           (PPS_TC8WO1G2R_TC8WO1G2_RPB5_Val << PPS_TC8WO1G2R_TC8WO1G2_Pos) /* (PPS_TC8WO1G2R) RPB5 Position */
#define PPS_TC8WO1G2R_TC8WO1G2_RPB9           (PPS_TC8WO1G2R_TC8WO1G2_RPB9_Val << PPS_TC8WO1G2R_TC8WO1G2_Pos) /* (PPS_TC8WO1G2R) RPB9 Position */
#define PPS_TC8WO1G2R_TC8WO1G2_RPB13          (PPS_TC8WO1G2R_TC8WO1G2_RPB13_Val << PPS_TC8WO1G2R_TC8WO1G2_Pos) /* (PPS_TC8WO1G2R) RPB13 Position */
#define PPS_TC8WO1G2R_TC8WO1G2_RPB0           (PPS_TC8WO1G2R_TC8WO1G2_RPB0_Val << PPS_TC8WO1G2R_TC8WO1G2_Pos) /* (PPS_TC8WO1G2R) RPB0 Position */
#define PPS_TC8WO1G2R_TC8WO1G2_RPB4           (PPS_TC8WO1G2R_TC8WO1G2_RPB4_Val << PPS_TC8WO1G2R_TC8WO1G2_Pos) /* (PPS_TC8WO1G2R) RPB4 Position */
#define PPS_TC8WO1G2R_TC8WO1G2_RPB8           (PPS_TC8WO1G2R_TC8WO1G2_RPB8_Val << PPS_TC8WO1G2R_TC8WO1G2_Pos) /* (PPS_TC8WO1G2R) RPB8 Position */
#define PPS_TC8WO1G2R_TC8WO1G2_RPA0           (PPS_TC8WO1G2R_TC8WO1G2_RPA0_Val << PPS_TC8WO1G2R_TC8WO1G2_Pos) /* (PPS_TC8WO1G2R) RPA0 Position */
#define PPS_TC8WO1G2R_TC8WO1G2_RPA11          (PPS_TC8WO1G2R_TC8WO1G2_RPA11_Val << PPS_TC8WO1G2R_TC8WO1G2_Pos) /* (PPS_TC8WO1G2R) RPA11 Position */
#define PPS_TC8WO1G2R_Msk                     _UINT32_(0x0000001F)                                 /* (PPS_TC8WO1G2R) Register Mask  */


/* -------- PPS_TC8WO1G5R : (PPS Offset: 0x158) (R/W 32)  -------- */
#define PPS_TC8WO1G5R_RESETVALUE              _UINT32_(0x00)                                       /*  (PPS_TC8WO1G5R)   Reset Value */

#define PPS_TC8WO1G5R_TC8WO1G5_Pos            _UINT32_(0)                                          /* (PPS_TC8WO1G5R) TC8/WO1G5 Position */
#define PPS_TC8WO1G5R_TC8WO1G5_Msk            (_UINT32_(0x1F) << PPS_TC8WO1G5R_TC8WO1G5_Pos)       /* (PPS_TC8WO1G5R) TC8/WO1G5 Mask */
#define PPS_TC8WO1G5R_TC8WO1G5(value)         (PPS_TC8WO1G5R_TC8WO1G5_Msk & (_UINT32_(value) << PPS_TC8WO1G5R_TC8WO1G5_Pos)) /* Assignment of value for TC8WO1G5 in the PPS_TC8WO1G5R register */
#define   PPS_TC8WO1G5R_TC8WO1G5_OFF_Val      _UINT32_(0x0)                                        /* (PPS_TC8WO1G5R) OFF  */
#define   PPS_TC8WO1G5R_TC8WO1G5_RPA4_Val     _UINT32_(0x1)                                        /* (PPS_TC8WO1G5R) RPA4  */
#define   PPS_TC8WO1G5R_TC8WO1G5_RPA10_Val    _UINT32_(0x2)                                        /* (PPS_TC8WO1G5R) RPA10  */
#define   PPS_TC8WO1G5R_TC8WO1G5_RPB4_Val     _UINT32_(0x3)                                        /* (PPS_TC8WO1G5R) RPB4  */
#define   PPS_TC8WO1G5R_TC8WO1G5_RPB10_Val    _UINT32_(0x4)                                        /* (PPS_TC8WO1G5R) RPB10  */
#define   PPS_TC8WO1G5R_TC8WO1G5_RPD4_Val     _UINT32_(0x5)                                        /* (PPS_TC8WO1G5R) RPD4  */
#define   PPS_TC8WO1G5R_TC8WO1G5_RPE4_Val     _UINT32_(0x6)                                        /* (PPS_TC8WO1G5R) RPE4  */
#define   PPS_TC8WO1G5R_TC8WO1G5_RPA1_Val     _UINT32_(0x7)                                        /* (PPS_TC8WO1G5R) RPA1  */
#define   PPS_TC8WO1G5R_TC8WO1G5_RPB0_Val     _UINT32_(0x8)                                        /* (PPS_TC8WO1G5R) RPB0  */
#define   PPS_TC8WO1G5R_TC8WO1G5_RPC8_Val     _UINT32_(0x9)                                        /* (PPS_TC8WO1G5R) RPC8  */
#define   PPS_TC8WO1G5R_TC8WO1G5_RPD2_Val     _UINT32_(0xA)                                        /* (PPS_TC8WO1G5R) RPD2  */
#define   PPS_TC8WO1G5R_TC8WO1G5_RPE2_Val     _UINT32_(0xB)                                        /* (PPS_TC8WO1G5R) RPE2  */
#define   PPS_TC8WO1G5R_TC8WO1G5_RPC10_Val    _UINT32_(0xC)                                        /* (PPS_TC8WO1G5R) RPC10  */
#define   PPS_TC8WO1G5R_TC8WO1G5_RPC11_Val    _UINT32_(0xD)                                        /* (PPS_TC8WO1G5R) RPC11  */
#define   PPS_TC8WO1G5R_TC8WO1G5_RPA15_Val    _UINT32_(0xE)                                        /* (PPS_TC8WO1G5R) RPA15  */
#define   PPS_TC8WO1G5R_TC8WO1G5_RPB14_Val    _UINT32_(0xF)                                        /* (PPS_TC8WO1G5R) RPB14  */
#define   PPS_TC8WO1G5R_TC8WO1G5_RPB15_Val    _UINT32_(0x10)                                       /* (PPS_TC8WO1G5R) RPB15  */
#define   PPS_TC8WO1G5R_TC8WO1G5_RPD0_Val     _UINT32_(0x11)                                       /* (PPS_TC8WO1G5R) RPD0  */
#define   PPS_TC8WO1G5R_TC8WO1G5_RPD1_Val     _UINT32_(0x12)                                       /* (PPS_TC8WO1G5R) RPD1  */
#define PPS_TC8WO1G5R_TC8WO1G5_OFF            (PPS_TC8WO1G5R_TC8WO1G5_OFF_Val << PPS_TC8WO1G5R_TC8WO1G5_Pos) /* (PPS_TC8WO1G5R) OFF Position */
#define PPS_TC8WO1G5R_TC8WO1G5_RPA4           (PPS_TC8WO1G5R_TC8WO1G5_RPA4_Val << PPS_TC8WO1G5R_TC8WO1G5_Pos) /* (PPS_TC8WO1G5R) RPA4 Position */
#define PPS_TC8WO1G5R_TC8WO1G5_RPA10          (PPS_TC8WO1G5R_TC8WO1G5_RPA10_Val << PPS_TC8WO1G5R_TC8WO1G5_Pos) /* (PPS_TC8WO1G5R) RPA10 Position */
#define PPS_TC8WO1G5R_TC8WO1G5_RPB4           (PPS_TC8WO1G5R_TC8WO1G5_RPB4_Val << PPS_TC8WO1G5R_TC8WO1G5_Pos) /* (PPS_TC8WO1G5R) RPB4 Position */
#define PPS_TC8WO1G5R_TC8WO1G5_RPB10          (PPS_TC8WO1G5R_TC8WO1G5_RPB10_Val << PPS_TC8WO1G5R_TC8WO1G5_Pos) /* (PPS_TC8WO1G5R) RPB10 Position */
#define PPS_TC8WO1G5R_TC8WO1G5_RPD4           (PPS_TC8WO1G5R_TC8WO1G5_RPD4_Val << PPS_TC8WO1G5R_TC8WO1G5_Pos) /* (PPS_TC8WO1G5R) RPD4 Position */
#define PPS_TC8WO1G5R_TC8WO1G5_RPE4           (PPS_TC8WO1G5R_TC8WO1G5_RPE4_Val << PPS_TC8WO1G5R_TC8WO1G5_Pos) /* (PPS_TC8WO1G5R) RPE4 Position */
#define PPS_TC8WO1G5R_TC8WO1G5_RPA1           (PPS_TC8WO1G5R_TC8WO1G5_RPA1_Val << PPS_TC8WO1G5R_TC8WO1G5_Pos) /* (PPS_TC8WO1G5R) RPA1 Position */
#define PPS_TC8WO1G5R_TC8WO1G5_RPB0           (PPS_TC8WO1G5R_TC8WO1G5_RPB0_Val << PPS_TC8WO1G5R_TC8WO1G5_Pos) /* (PPS_TC8WO1G5R) RPB0 Position */
#define PPS_TC8WO1G5R_TC8WO1G5_RPC8           (PPS_TC8WO1G5R_TC8WO1G5_RPC8_Val << PPS_TC8WO1G5R_TC8WO1G5_Pos) /* (PPS_TC8WO1G5R) RPC8 Position */
#define PPS_TC8WO1G5R_TC8WO1G5_RPD2           (PPS_TC8WO1G5R_TC8WO1G5_RPD2_Val << PPS_TC8WO1G5R_TC8WO1G5_Pos) /* (PPS_TC8WO1G5R) RPD2 Position */
#define PPS_TC8WO1G5R_TC8WO1G5_RPE2           (PPS_TC8WO1G5R_TC8WO1G5_RPE2_Val << PPS_TC8WO1G5R_TC8WO1G5_Pos) /* (PPS_TC8WO1G5R) RPE2 Position */
#define PPS_TC8WO1G5R_TC8WO1G5_RPC10          (PPS_TC8WO1G5R_TC8WO1G5_RPC10_Val << PPS_TC8WO1G5R_TC8WO1G5_Pos) /* (PPS_TC8WO1G5R) RPC10 Position */
#define PPS_TC8WO1G5R_TC8WO1G5_RPC11          (PPS_TC8WO1G5R_TC8WO1G5_RPC11_Val << PPS_TC8WO1G5R_TC8WO1G5_Pos) /* (PPS_TC8WO1G5R) RPC11 Position */
#define PPS_TC8WO1G5R_TC8WO1G5_RPA15          (PPS_TC8WO1G5R_TC8WO1G5_RPA15_Val << PPS_TC8WO1G5R_TC8WO1G5_Pos) /* (PPS_TC8WO1G5R) RPA15 Position */
#define PPS_TC8WO1G5R_TC8WO1G5_RPB14          (PPS_TC8WO1G5R_TC8WO1G5_RPB14_Val << PPS_TC8WO1G5R_TC8WO1G5_Pos) /* (PPS_TC8WO1G5R) RPB14 Position */
#define PPS_TC8WO1G5R_TC8WO1G5_RPB15          (PPS_TC8WO1G5R_TC8WO1G5_RPB15_Val << PPS_TC8WO1G5R_TC8WO1G5_Pos) /* (PPS_TC8WO1G5R) RPB15 Position */
#define PPS_TC8WO1G5R_TC8WO1G5_RPD0           (PPS_TC8WO1G5R_TC8WO1G5_RPD0_Val << PPS_TC8WO1G5R_TC8WO1G5_Pos) /* (PPS_TC8WO1G5R) RPD0 Position */
#define PPS_TC8WO1G5R_TC8WO1G5_RPD1           (PPS_TC8WO1G5R_TC8WO1G5_RPD1_Val << PPS_TC8WO1G5R_TC8WO1G5_Pos) /* (PPS_TC8WO1G5R) RPD1 Position */
#define PPS_TC8WO1G5R_Msk                     _UINT32_(0x0000001F)                                 /* (PPS_TC8WO1G5R) Register Mask  */


/* -------- PPS_TC9WO0G2R : (PPS Offset: 0x15C) (R/W 32)  -------- */
#define PPS_TC9WO0G2R_RESETVALUE              _UINT32_(0x00)                                       /*  (PPS_TC9WO0G2R)   Reset Value */

#define PPS_TC9WO0G2R_TC9WO0G2_Pos            _UINT32_(0)                                          /* (PPS_TC9WO0G2R) TC9/WO0G2 Position */
#define PPS_TC9WO0G2R_TC9WO0G2_Msk            (_UINT32_(0x1F) << PPS_TC9WO0G2R_TC9WO0G2_Pos)       /* (PPS_TC9WO0G2R) TC9/WO0G2 Mask */
#define PPS_TC9WO0G2R_TC9WO0G2(value)         (PPS_TC9WO0G2R_TC9WO0G2_Msk & (_UINT32_(value) << PPS_TC9WO0G2R_TC9WO0G2_Pos)) /* Assignment of value for TC9WO0G2 in the PPS_TC9WO0G2R register */
#define   PPS_TC9WO0G2R_TC9WO0G2_OFF_Val      _UINT32_(0x0)                                        /* (PPS_TC9WO0G2R) OFF  */
#define   PPS_TC9WO0G2R_TC9WO0G2_RPA1_Val     _UINT32_(0x1)                                        /* (PPS_TC9WO0G2R) RPA1  */
#define   PPS_TC9WO0G2R_TC9WO0G2_RPA7_Val     _UINT32_(0x2)                                        /* (PPS_TC9WO0G2R) RPA7  */
#define   PPS_TC9WO0G2R_TC9WO0G2_RPA12_Val    _UINT32_(0x3)                                        /* (PPS_TC9WO0G2R) RPA12  */
#define   PPS_TC9WO0G2R_TC9WO0G2_RPB1_Val     _UINT32_(0x4)                                        /* (PPS_TC9WO0G2R) RPB1  */
#define   PPS_TC9WO0G2R_TC9WO0G2_RPB7_Val     _UINT32_(0x5)                                        /* (PPS_TC9WO0G2R) RPB7  */
#define   PPS_TC9WO0G2R_TC9WO0G2_RPC1_Val     _UINT32_(0x6)                                        /* (PPS_TC9WO0G2R) RPC1  */
#define   PPS_TC9WO0G2R_TC9WO0G2_RPC7_Val     _UINT32_(0x7)                                        /* (PPS_TC9WO0G2R) RPC7  */
#define   PPS_TC9WO0G2R_TC9WO0G2_RPD7_Val     _UINT32_(0x8)                                        /* (PPS_TC9WO0G2R) RPD7  */
#define   PPS_TC9WO0G2R_TC9WO0G2_RPE1_Val     _UINT32_(0x9)                                        /* (PPS_TC9WO0G2R) RPE1  */
#define   PPS_TC9WO0G2R_TC9WO0G2_RPA3_Val     _UINT32_(0xA)                                        /* (PPS_TC9WO0G2R) RPA3  */
#define   PPS_TC9WO0G2R_TC9WO0G2_RPB2_Val     _UINT32_(0xB)                                        /* (PPS_TC9WO0G2R) RPB2  */
#define   PPS_TC9WO0G2R_TC9WO0G2_RPC0_Val     _UINT32_(0xC)                                        /* (PPS_TC9WO0G2R) RPC0  */
#define   PPS_TC9WO0G2R_TC9WO0G2_RPD4_Val     _UINT32_(0xD)                                        /* (PPS_TC9WO0G2R) RPD4  */
#define   PPS_TC9WO0G2R_TC9WO0G2_RPE6_Val     _UINT32_(0xE)                                        /* (PPS_TC9WO0G2R) RPE6  */
#define   PPS_TC9WO0G2R_TC9WO0G2_RPA4_Val     _UINT32_(0xF)                                        /* (PPS_TC9WO0G2R) RPA4  */
#define   PPS_TC9WO0G2R_TC9WO0G2_RPA8_Val     _UINT32_(0x10)                                       /* (PPS_TC9WO0G2R) RPA8  */
#define   PPS_TC9WO0G2R_TC9WO0G2_RPB12_Val    _UINT32_(0x11)                                       /* (PPS_TC9WO0G2R) RPB12  */
#define   PPS_TC9WO0G2R_TC9WO0G2_RPB5_Val     _UINT32_(0x12)                                       /* (PPS_TC9WO0G2R) RPB5  */
#define   PPS_TC9WO0G2R_TC9WO0G2_RPB9_Val     _UINT32_(0x13)                                       /* (PPS_TC9WO0G2R) RPB9  */
#define   PPS_TC9WO0G2R_TC9WO0G2_RPB13_Val    _UINT32_(0x14)                                       /* (PPS_TC9WO0G2R) RPB13  */
#define   PPS_TC9WO0G2R_TC9WO0G2_RPB0_Val     _UINT32_(0x15)                                       /* (PPS_TC9WO0G2R) RPB0  */
#define   PPS_TC9WO0G2R_TC9WO0G2_RPB4_Val     _UINT32_(0x16)                                       /* (PPS_TC9WO0G2R) RPB4  */
#define   PPS_TC9WO0G2R_TC9WO0G2_RPB8_Val     _UINT32_(0x17)                                       /* (PPS_TC9WO0G2R) RPB8  */
#define   PPS_TC9WO0G2R_TC9WO0G2_RPA0_Val     _UINT32_(0x18)                                       /* (PPS_TC9WO0G2R) RPA0  */
#define   PPS_TC9WO0G2R_TC9WO0G2_RPA11_Val    _UINT32_(0x19)                                       /* (PPS_TC9WO0G2R) RPA11  */
#define PPS_TC9WO0G2R_TC9WO0G2_OFF            (PPS_TC9WO0G2R_TC9WO0G2_OFF_Val << PPS_TC9WO0G2R_TC9WO0G2_Pos) /* (PPS_TC9WO0G2R) OFF Position */
#define PPS_TC9WO0G2R_TC9WO0G2_RPA1           (PPS_TC9WO0G2R_TC9WO0G2_RPA1_Val << PPS_TC9WO0G2R_TC9WO0G2_Pos) /* (PPS_TC9WO0G2R) RPA1 Position */
#define PPS_TC9WO0G2R_TC9WO0G2_RPA7           (PPS_TC9WO0G2R_TC9WO0G2_RPA7_Val << PPS_TC9WO0G2R_TC9WO0G2_Pos) /* (PPS_TC9WO0G2R) RPA7 Position */
#define PPS_TC9WO0G2R_TC9WO0G2_RPA12          (PPS_TC9WO0G2R_TC9WO0G2_RPA12_Val << PPS_TC9WO0G2R_TC9WO0G2_Pos) /* (PPS_TC9WO0G2R) RPA12 Position */
#define PPS_TC9WO0G2R_TC9WO0G2_RPB1           (PPS_TC9WO0G2R_TC9WO0G2_RPB1_Val << PPS_TC9WO0G2R_TC9WO0G2_Pos) /* (PPS_TC9WO0G2R) RPB1 Position */
#define PPS_TC9WO0G2R_TC9WO0G2_RPB7           (PPS_TC9WO0G2R_TC9WO0G2_RPB7_Val << PPS_TC9WO0G2R_TC9WO0G2_Pos) /* (PPS_TC9WO0G2R) RPB7 Position */
#define PPS_TC9WO0G2R_TC9WO0G2_RPC1           (PPS_TC9WO0G2R_TC9WO0G2_RPC1_Val << PPS_TC9WO0G2R_TC9WO0G2_Pos) /* (PPS_TC9WO0G2R) RPC1 Position */
#define PPS_TC9WO0G2R_TC9WO0G2_RPC7           (PPS_TC9WO0G2R_TC9WO0G2_RPC7_Val << PPS_TC9WO0G2R_TC9WO0G2_Pos) /* (PPS_TC9WO0G2R) RPC7 Position */
#define PPS_TC9WO0G2R_TC9WO0G2_RPD7           (PPS_TC9WO0G2R_TC9WO0G2_RPD7_Val << PPS_TC9WO0G2R_TC9WO0G2_Pos) /* (PPS_TC9WO0G2R) RPD7 Position */
#define PPS_TC9WO0G2R_TC9WO0G2_RPE1           (PPS_TC9WO0G2R_TC9WO0G2_RPE1_Val << PPS_TC9WO0G2R_TC9WO0G2_Pos) /* (PPS_TC9WO0G2R) RPE1 Position */
#define PPS_TC9WO0G2R_TC9WO0G2_RPA3           (PPS_TC9WO0G2R_TC9WO0G2_RPA3_Val << PPS_TC9WO0G2R_TC9WO0G2_Pos) /* (PPS_TC9WO0G2R) RPA3 Position */
#define PPS_TC9WO0G2R_TC9WO0G2_RPB2           (PPS_TC9WO0G2R_TC9WO0G2_RPB2_Val << PPS_TC9WO0G2R_TC9WO0G2_Pos) /* (PPS_TC9WO0G2R) RPB2 Position */
#define PPS_TC9WO0G2R_TC9WO0G2_RPC0           (PPS_TC9WO0G2R_TC9WO0G2_RPC0_Val << PPS_TC9WO0G2R_TC9WO0G2_Pos) /* (PPS_TC9WO0G2R) RPC0 Position */
#define PPS_TC9WO0G2R_TC9WO0G2_RPD4           (PPS_TC9WO0G2R_TC9WO0G2_RPD4_Val << PPS_TC9WO0G2R_TC9WO0G2_Pos) /* (PPS_TC9WO0G2R) RPD4 Position */
#define PPS_TC9WO0G2R_TC9WO0G2_RPE6           (PPS_TC9WO0G2R_TC9WO0G2_RPE6_Val << PPS_TC9WO0G2R_TC9WO0G2_Pos) /* (PPS_TC9WO0G2R) RPE6 Position */
#define PPS_TC9WO0G2R_TC9WO0G2_RPA4           (PPS_TC9WO0G2R_TC9WO0G2_RPA4_Val << PPS_TC9WO0G2R_TC9WO0G2_Pos) /* (PPS_TC9WO0G2R) RPA4 Position */
#define PPS_TC9WO0G2R_TC9WO0G2_RPA8           (PPS_TC9WO0G2R_TC9WO0G2_RPA8_Val << PPS_TC9WO0G2R_TC9WO0G2_Pos) /* (PPS_TC9WO0G2R) RPA8 Position */
#define PPS_TC9WO0G2R_TC9WO0G2_RPB12          (PPS_TC9WO0G2R_TC9WO0G2_RPB12_Val << PPS_TC9WO0G2R_TC9WO0G2_Pos) /* (PPS_TC9WO0G2R) RPB12 Position */
#define PPS_TC9WO0G2R_TC9WO0G2_RPB5           (PPS_TC9WO0G2R_TC9WO0G2_RPB5_Val << PPS_TC9WO0G2R_TC9WO0G2_Pos) /* (PPS_TC9WO0G2R) RPB5 Position */
#define PPS_TC9WO0G2R_TC9WO0G2_RPB9           (PPS_TC9WO0G2R_TC9WO0G2_RPB9_Val << PPS_TC9WO0G2R_TC9WO0G2_Pos) /* (PPS_TC9WO0G2R) RPB9 Position */
#define PPS_TC9WO0G2R_TC9WO0G2_RPB13          (PPS_TC9WO0G2R_TC9WO0G2_RPB13_Val << PPS_TC9WO0G2R_TC9WO0G2_Pos) /* (PPS_TC9WO0G2R) RPB13 Position */
#define PPS_TC9WO0G2R_TC9WO0G2_RPB0           (PPS_TC9WO0G2R_TC9WO0G2_RPB0_Val << PPS_TC9WO0G2R_TC9WO0G2_Pos) /* (PPS_TC9WO0G2R) RPB0 Position */
#define PPS_TC9WO0G2R_TC9WO0G2_RPB4           (PPS_TC9WO0G2R_TC9WO0G2_RPB4_Val << PPS_TC9WO0G2R_TC9WO0G2_Pos) /* (PPS_TC9WO0G2R) RPB4 Position */
#define PPS_TC9WO0G2R_TC9WO0G2_RPB8           (PPS_TC9WO0G2R_TC9WO0G2_RPB8_Val << PPS_TC9WO0G2R_TC9WO0G2_Pos) /* (PPS_TC9WO0G2R) RPB8 Position */
#define PPS_TC9WO0G2R_TC9WO0G2_RPA0           (PPS_TC9WO0G2R_TC9WO0G2_RPA0_Val << PPS_TC9WO0G2R_TC9WO0G2_Pos) /* (PPS_TC9WO0G2R) RPA0 Position */
#define PPS_TC9WO0G2R_TC9WO0G2_RPA11          (PPS_TC9WO0G2R_TC9WO0G2_RPA11_Val << PPS_TC9WO0G2R_TC9WO0G2_Pos) /* (PPS_TC9WO0G2R) RPA11 Position */
#define PPS_TC9WO0G2R_Msk                     _UINT32_(0x0000001F)                                 /* (PPS_TC9WO0G2R) Register Mask  */


