Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/bootloader/firmware/src/packs/PIC32WM_BZ6204_DFP/component/pps.h
/* -------- PPS_COEXWLANACTR : (PPS Offset: 0x194) (R/W 32)  -------- */
#define PPS_COEXWLANACTR_RESETVALUE           _UINT32_(0x00)                                       /*  (PPS_COEXWLANACTR)   Reset Value */

#define PPS_COEXWLANACTR_COEXWLANACT_Pos      _UINT32_(0)                                          /* (PPS_COEXWLANACTR) COEX/WLAN_ACT Position */
#define PPS_COEXWLANACTR_COEXWLANACT_Msk      (_UINT32_(0x1F) << PPS_COEXWLANACTR_COEXWLANACT_Pos) /* (PPS_COEXWLANACTR) COEX/WLAN_ACT Mask */
#define PPS_COEXWLANACTR_COEXWLANACT(value)   (PPS_COEXWLANACTR_COEXWLANACT_Msk & (_UINT32_(value) << PPS_COEXWLANACTR_COEXWLANACT_Pos)) /* Assignment of value for COEXWLANACT in the PPS_COEXWLANACTR register */
#define   PPS_COEXWLANACTR_COEXWLANACT_OFF_Val _UINT32_(0x0)                                        /* (PPS_COEXWLANACTR) OFF  */
#define   PPS_COEXWLANACTR_COEXWLANACT_RPA3_Val _UINT32_(0x1)                                        /* (PPS_COEXWLANACTR) RPA3  */
#define   PPS_COEXWLANACTR_COEXWLANACT_RPA9_Val _UINT32_(0x2)                                        /* (PPS_COEXWLANACTR) RPA9  */
#define   PPS_COEXWLANACTR_COEXWLANACT_RPA14_Val _UINT32_(0x3)                                        /* (PPS_COEXWLANACTR) RPA14  */
#define   PPS_COEXWLANACTR_COEXWLANACT_RPB3_Val _UINT32_(0x4)                                        /* (PPS_COEXWLANACTR) RPB3  */
#define   PPS_COEXWLANACTR_COEXWLANACT_RPC9_Val _UINT32_(0x5)                                        /* (PPS_COEXWLANACTR) RPC9  */
#define   PPS_COEXWLANACTR_COEXWLANACT_RPD3_Val _UINT32_(0x6)                                        /* (PPS_COEXWLANACTR) RPD3  */
#define   PPS_COEXWLANACTR_COEXWLANACT_RPE3_Val _UINT32_(0x7)                                        /* (PPS_COEXWLANACTR) RPE3  */
#define   PPS_COEXWLANACTR_COEXWLANACT_RPA0_Val _UINT32_(0x8)                                        /* (PPS_COEXWLANACTR) RPA0  */
#define   PPS_COEXWLANACTR_COEXWLANACT_RPB4_Val _UINT32_(0x9)                                        /* (PPS_COEXWLANACTR) RPB4  */
#define   PPS_COEXWLANACTR_COEXWLANACT_RPC7_Val _UINT32_(0xA)                                        /* (PPS_COEXWLANACTR) RPC7  */
#define   PPS_COEXWLANACTR_COEXWLANACT_RPD7_Val _UINT32_(0xB)                                        /* (PPS_COEXWLANACTR) RPD7  */
#define   PPS_COEXWLANACTR_COEXWLANACT_RPE1_Val _UINT32_(0xC)                                        /* (PPS_COEXWLANACTR) RPE1  */
#define   PPS_COEXWLANACTR_COEXWLANACT_RPA6_Val _UINT32_(0xD)                                        /* (PPS_COEXWLANACTR) RPA6  */
#define   PPS_COEXWLANACTR_COEXWLANACT_RPA10_Val _UINT32_(0xE)                                        /* (PPS_COEXWLANACTR) RPA10  */
#define   PPS_COEXWLANACTR_COEXWLANACT_RPB7_Val _UINT32_(0xF)                                        /* (PPS_COEXWLANACTR) RPB7  */
#define   PPS_COEXWLANACTR_COEXWLANACT_RPB11_Val _UINT32_(0x10)                                       /* (PPS_COEXWLANACTR) RPB11  */
#define   PPS_COEXWLANACTR_COEXWLANACT_RPA1_Val _UINT32_(0x11)                                       /* (PPS_COEXWLANACTR) RPA1  */
#define   PPS_COEXWLANACTR_COEXWLANACT_RPA5_Val _UINT32_(0x12)                                       /* (PPS_COEXWLANACTR) RPA5  */
#define   PPS_COEXWLANACTR_COEXWLANACT_RPA13_Val _UINT32_(0x13)                                       /* (PPS_COEXWLANACTR) RPA13  */
#define   PPS_COEXWLANACTR_COEXWLANACT_RPB2_Val _UINT32_(0x14)                                       /* (PPS_COEXWLANACTR) RPB2  */
#define   PPS_COEXWLANACTR_COEXWLANACT_RPB6_Val _UINT32_(0x15)                                       /* (PPS_COEXWLANACTR) RPB6  */
#define   PPS_COEXWLANACTR_COEXWLANACT_RPB10_Val _UINT32_(0x16)                                       /* (PPS_COEXWLANACTR) RPB10  */
#define   PPS_COEXWLANACTR_COEXWLANACT_RPA8_Val _UINT32_(0x17)                                       /* (PPS_COEXWLANACTR) RPA8  */
#define   PPS_COEXWLANACTR_COEXWLANACT_RPA2_Val _UINT32_(0x18)                                       /* (PPS_COEXWLANACTR) RPA2  */
#define PPS_COEXWLANACTR_COEXWLANACT_OFF      (PPS_COEXWLANACTR_COEXWLANACT_OFF_Val << PPS_COEXWLANACTR_COEXWLANACT_Pos) /* (PPS_COEXWLANACTR) OFF Position */
#define PPS_COEXWLANACTR_COEXWLANACT_RPA3     (PPS_COEXWLANACTR_COEXWLANACT_RPA3_Val << PPS_COEXWLANACTR_COEXWLANACT_Pos) /* (PPS_COEXWLANACTR) RPA3 Position */
#define PPS_COEXWLANACTR_COEXWLANACT_RPA9     (PPS_COEXWLANACTR_COEXWLANACT_RPA9_Val << PPS_COEXWLANACTR_COEXWLANACT_Pos) /* (PPS_COEXWLANACTR) RPA9 Position */
#define PPS_COEXWLANACTR_COEXWLANACT_RPA14    (PPS_COEXWLANACTR_COEXWLANACT_RPA14_Val << PPS_COEXWLANACTR_COEXWLANACT_Pos) /* (PPS_COEXWLANACTR) RPA14 Position */
#define PPS_COEXWLANACTR_COEXWLANACT_RPB3     (PPS_COEXWLANACTR_COEXWLANACT_RPB3_Val << PPS_COEXWLANACTR_COEXWLANACT_Pos) /* (PPS_COEXWLANACTR) RPB3 Position */
#define PPS_COEXWLANACTR_COEXWLANACT_RPC9     (PPS_COEXWLANACTR_COEXWLANACT_RPC9_Val << PPS_COEXWLANACTR_COEXWLANACT_Pos) /* (PPS_COEXWLANACTR) RPC9 Position */
#define PPS_COEXWLANACTR_COEXWLANACT_RPD3     (PPS_COEXWLANACTR_COEXWLANACT_RPD3_Val << PPS_COEXWLANACTR_COEXWLANACT_Pos) /* (PPS_COEXWLANACTR) RPD3 Position */
#define PPS_COEXWLANACTR_COEXWLANACT_RPE3     (PPS_COEXWLANACTR_COEXWLANACT_RPE3_Val << PPS_COEXWLANACTR_COEXWLANACT_Pos) /* (PPS_COEXWLANACTR) RPE3 Position */
#define PPS_COEXWLANACTR_COEXWLANACT_RPA0     (PPS_COEXWLANACTR_COEXWLANACT_RPA0_Val << PPS_COEXWLANACTR_COEXWLANACT_Pos) /* (PPS_COEXWLANACTR) RPA0 Position */
#define PPS_COEXWLANACTR_COEXWLANACT_RPB4     (PPS_COEXWLANACTR_COEXWLANACT_RPB4_Val << PPS_COEXWLANACTR_COEXWLANACT_Pos) /* (PPS_COEXWLANACTR) RPB4 Position */
#define PPS_COEXWLANACTR_COEXWLANACT_RPC7     (PPS_COEXWLANACTR_COEXWLANACT_RPC7_Val << PPS_COEXWLANACTR_COEXWLANACT_Pos) /* (PPS_COEXWLANACTR) RPC7 Position */
#define PPS_COEXWLANACTR_COEXWLANACT_RPD7     (PPS_COEXWLANACTR_COEXWLANACT_RPD7_Val << PPS_COEXWLANACTR_COEXWLANACT_Pos) /* (PPS_COEXWLANACTR) RPD7 Position */
#define PPS_COEXWLANACTR_COEXWLANACT_RPE1     (PPS_COEXWLANACTR_COEXWLANACT_RPE1_Val << PPS_COEXWLANACTR_COEXWLANACT_Pos) /* (PPS_COEXWLANACTR) RPE1 Position */
#define PPS_COEXWLANACTR_COEXWLANACT_RPA6     (PPS_COEXWLANACTR_COEXWLANACT_RPA6_Val << PPS_COEXWLANACTR_COEXWLANACT_Pos) /* (PPS_COEXWLANACTR) RPA6 Position */
#define PPS_COEXWLANACTR_COEXWLANACT_RPA10    (PPS_COEXWLANACTR_COEXWLANACT_RPA10_Val << PPS_COEXWLANACTR_COEXWLANACT_Pos) /* (PPS_COEXWLANACTR) RPA10 Position */
#define PPS_COEXWLANACTR_COEXWLANACT_RPB7     (PPS_COEXWLANACTR_COEXWLANACT_RPB7_Val << PPS_COEXWLANACTR_COEXWLANACT_Pos) /* (PPS_COEXWLANACTR) RPB7 Position */
#define PPS_COEXWLANACTR_COEXWLANACT_RPB11    (PPS_COEXWLANACTR_COEXWLANACT_RPB11_Val << PPS_COEXWLANACTR_COEXWLANACT_Pos) /* (PPS_COEXWLANACTR) RPB11 Position */
#define PPS_COEXWLANACTR_COEXWLANACT_RPA1     (PPS_COEXWLANACTR_COEXWLANACT_RPA1_Val << PPS_COEXWLANACTR_COEXWLANACT_Pos) /* (PPS_COEXWLANACTR) RPA1 Position */
#define PPS_COEXWLANACTR_COEXWLANACT_RPA5     (PPS_COEXWLANACTR_COEXWLANACT_RPA5_Val << PPS_COEXWLANACTR_COEXWLANACT_Pos) /* (PPS_COEXWLANACTR) RPA5 Position */
#define PPS_COEXWLANACTR_COEXWLANACT_RPA13    (PPS_COEXWLANACTR_COEXWLANACT_RPA13_Val << PPS_COEXWLANACTR_COEXWLANACT_Pos) /* (PPS_COEXWLANACTR) RPA13 Position */
#define PPS_COEXWLANACTR_COEXWLANACT_RPB2     (PPS_COEXWLANACTR_COEXWLANACT_RPB2_Val << PPS_COEXWLANACTR_COEXWLANACT_Pos) /* (PPS_COEXWLANACTR) RPB2 Position */
#define PPS_COEXWLANACTR_COEXWLANACT_RPB6     (PPS_COEXWLANACTR_COEXWLANACT_RPB6_Val << PPS_COEXWLANACTR_COEXWLANACT_Pos) /* (PPS_COEXWLANACTR) RPB6 Position */
#define PPS_COEXWLANACTR_COEXWLANACT_RPB10    (PPS_COEXWLANACTR_COEXWLANACT_RPB10_Val << PPS_COEXWLANACTR_COEXWLANACT_Pos) /* (PPS_COEXWLANACTR) RPB10 Position */
#define PPS_COEXWLANACTR_COEXWLANACT_RPA8     (PPS_COEXWLANACTR_COEXWLANACT_RPA8_Val << PPS_COEXWLANACTR_COEXWLANACT_Pos) /* (PPS_COEXWLANACTR) RPA8 Position */
#define PPS_COEXWLANACTR_COEXWLANACT_RPA2     (PPS_COEXWLANACTR_COEXWLANACT_RPA2_Val << PPS_COEXWLANACTR_COEXWLANACT_Pos) /* (PPS_COEXWLANACTR) RPA2 Position */
#define PPS_COEXWLANACTR_Msk                  _UINT32_(0x0000001F)                                 /* (PPS_COEXWLANACTR) Register Mask  */


