Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/bootloader/firmware/src/packs/PIC32WM_BZ6204_DFP/component/pps.h
#define PPS_RPA2G1R_RPA2G1R_Pos               _UINT32_(0)                                          /* (PPS_RPA2G1R) RPA2/G1 Position */
#define PPS_RPA2G1R_RPA2G1R_Msk               (_UINT32_(0x3F) << PPS_RPA2G1R_RPA2G1R_Pos)          /* (PPS_RPA2G1R) RPA2/G1 Mask */
#define PPS_RPA2G1R_RPA2G1R(value)            (PPS_RPA2G1R_RPA2G1R_Msk & (_UINT32_(value) << PPS_RPA2G1R_RPA2G1R_Pos)) /* Assignment of value for RPA2G1R in the PPS_RPA2G1R register */
#define   PPS_RPA2G1R_RPA2G1R_OFF_Val         _UINT32_(0x0)                                        /* (PPS_RPA2G1R) OFF  */
#define   PPS_RPA2G1R_RPA2G1R_SCOM0P3_Val     _UINT32_(0x1)                                        /* (PPS_RPA2G1R) SERCOM0/PAD3  */
#define   PPS_RPA2G1R_RPA2G1R_SCOM0P2_Val     _UINT32_(0x2)                                        /* (PPS_RPA2G1R) SERCOM0/PAD2  */
#define   PPS_RPA2G1R_RPA2G1R_SCOM1P0_Val     _UINT32_(0x3)                                        /* (PPS_RPA2G1R) SERCOM1/PAD0  */
#define   PPS_RPA2G1R_RPA2G1R_SCOM1P2_Val     _UINT32_(0x4)                                        /* (PPS_RPA2G1R) SERCOM1/PAD2  */
#define   PPS_RPA2G1R_RPA2G1R_SCOM2P3_Val     _UINT32_(0x5)                                        /* (PPS_RPA2G1R) SERCOM2/PAD3  */
#define   PPS_RPA2G1R_RPA2G1R_SCOM2P2_Val     _UINT32_(0x6)                                        /* (PPS_RPA2G1R) SERCOM2/PAD2  */
#define   PPS_RPA2G1R_RPA2G1R_SCOM3P0_Val     _UINT32_(0x7)                                        /* (PPS_RPA2G1R) SERCOM3/PAD0  */
#define   PPS_RPA2G1R_RPA2G1R_SCOM3P2_Val     _UINT32_(0x8)                                        /* (PPS_RPA2G1R) SERCOM3/PAD2  */
#define   PPS_RPA2G1R_RPA2G1R_SCOM4P3_Val     _UINT32_(0x9)                                        /* (PPS_RPA2G1R) SERCOM4/PAD3  */
#define   PPS_RPA2G1R_RPA2G1R_SCOM4P2_Val     _UINT32_(0xA)                                        /* (PPS_RPA2G1R) SERCOM4/PAD2  */
#define   PPS_RPA2G1R_RPA2G1R_SCOM5P0_Val     _UINT32_(0xB)                                        /* (PPS_RPA2G1R) SERCOM5/PAD0  */
#define   PPS_RPA2G1R_RPA2G1R_SCOM5P2_Val     _UINT32_(0xC)                                        /* (PPS_RPA2G1R) SERCOM5/PAD2  */
#define   PPS_RPA2G1R_RPA2G1R_TCC0WO0_Val     _UINT32_(0xD)                                        /* (PPS_RPA2G1R) TCC0/WO0  */
#define   PPS_RPA2G1R_RPA2G1R_TCC0WO4_Val     _UINT32_(0xE)                                        /* (PPS_RPA2G1R) TCC0/WO4  */
#define   PPS_RPA2G1R_RPA2G1R_TCC1WO0_Val     _UINT32_(0xF)                                        /* (PPS_RPA2G1R) TCC1/WO0  */
#define   PPS_RPA2G1R_RPA2G1R_TCC1WO4_Val     _UINT32_(0x10)                                       /* (PPS_RPA2G1R) TCC1/WO4  */
#define   PPS_RPA2G1R_RPA2G1R_TCC2WO0_Val     _UINT32_(0x11)                                       /* (PPS_RPA2G1R) TCC2/WO0  */
#define   PPS_RPA2G1R_RPA2G1R_TC0WO1_Val      _UINT32_(0x12)                                       /* (PPS_RPA2G1R) TC0/WO1  */
#define   PPS_RPA2G1R_RPA2G1R_TC1WO0_Val      _UINT32_(0x13)                                       /* (PPS_RPA2G1R) TC1/WO0  */
#define   PPS_RPA2G1R_RPA2G1R_TC2WO0_Val      _UINT32_(0x14)                                       /* (PPS_RPA2G1R) TC2/WO0  */
#define   PPS_RPA2G1R_RPA2G1R_TC3WO0_Val      _UINT32_(0x15)                                       /* (PPS_RPA2G1R) TC3/WO0  */
#define   PPS_RPA2G1R_RPA2G1R_TC4WO0_Val      _UINT32_(0x16)                                       /* (PPS_RPA2G1R) TC4/WO0  */
#define   PPS_RPA2G1R_RPA2G1R_TC5WO0_Val      _UINT32_(0x17)                                       /* (PPS_RPA2G1R) TC5/WO0  */
#define   PPS_RPA2G1R_RPA2G1R_TC6WO0_Val      _UINT32_(0x18)                                       /* (PPS_RPA2G1R) TC6/WO0  */
#define   PPS_RPA2G1R_RPA2G1R_TC7WO0_Val      _UINT32_(0x19)                                       /* (PPS_RPA2G1R) TC7/WO0  */
#define   PPS_RPA2G1R_RPA2G1R_TC8WO0_Val      _UINT32_(0x1A)                                       /* (PPS_RPA2G1R) TC8/WO0  */
#define   PPS_RPA2G1R_RPA2G1R_QSPICS_Val      _UINT32_(0x1B)                                       /* (PPS_RPA2G1R) QSPI/CS  */
#define   PPS_RPA2G1R_RPA2G1R_QD3_Val         _UINT32_(0x1C)                                       /* (PPS_RPA2G1R) QSPI/DATA3  */
#define   PPS_RPA2G1R_RPA2G1R_QD2_Val         _UINT32_(0x1D)                                       /* (PPS_RPA2G1R) QSPI/DATA2  */
#define   PPS_RPA2G1R_RPA2G1R_QD1_Val         _UINT32_(0x1E)                                       /* (PPS_RPA2G1R) QSPI/DATA1  */
#define   PPS_RPA2G1R_RPA2G1R_QEICCMP0_Val    _UINT32_(0x1F)                                       /* (PPS_RPA2G1R) QEI/CCMP0  */
#define   PPS_RPA2G1R_RPA2G1R_TSTBUS0_Val     _UINT32_(0x20)                                       /* (PPS_RPA2G1R) TSTBUS0  */
#define   PPS_RPA2G1R_RPA2G1R_TSTBUS4_Val     _UINT32_(0x21)                                       /* (PPS_RPA2G1R) TSTBUS4  */
#define   PPS_RPA2G1R_RPA2G1R_TSTBUS8_Val     _UINT32_(0x22)                                       /* (PPS_RPA2G1R) TSTBUS8  */
#define   PPS_RPA2G1R_RPA2G1R_FECTRL1_Val     _UINT32_(0x23)                                       /* (PPS_RPA2G1R) FECTRL1  */
#define   PPS_RPA2G1R_RPA2G1R_FECTRL2_Val     _UINT32_(0x24)                                       /* (PPS_RPA2G1R) FECTRL2  */
#define   PPS_RPA2G1R_RPA2G1R_COEX_BT_STATE_Val _UINT32_(0x25)                                       /* (PPS_RPA2G1R) COEX/BT/STATE  */
#define PPS_RPA2G1R_RPA2G1R_OFF               (PPS_RPA2G1R_RPA2G1R_OFF_Val << PPS_RPA2G1R_RPA2G1R_Pos) /* (PPS_RPA2G1R) OFF Position */
#define PPS_RPA2G1R_RPA2G1R_SCOM0P3           (PPS_RPA2G1R_RPA2G1R_SCOM0P3_Val << PPS_RPA2G1R_RPA2G1R_Pos) /* (PPS_RPA2G1R) SERCOM0/PAD3 Position */
#define PPS_RPA2G1R_RPA2G1R_SCOM0P2           (PPS_RPA2G1R_RPA2G1R_SCOM0P2_Val << PPS_RPA2G1R_RPA2G1R_Pos) /* (PPS_RPA2G1R) SERCOM0/PAD2 Position */
#define PPS_RPA2G1R_RPA2G1R_SCOM1P0           (PPS_RPA2G1R_RPA2G1R_SCOM1P0_Val << PPS_RPA2G1R_RPA2G1R_Pos) /* (PPS_RPA2G1R) SERCOM1/PAD0 Position */
#define PPS_RPA2G1R_RPA2G1R_SCOM1P2           (PPS_RPA2G1R_RPA2G1R_SCOM1P2_Val << PPS_RPA2G1R_RPA2G1R_Pos) /* (PPS_RPA2G1R) SERCOM1/PAD2 Position */
#define PPS_RPA2G1R_RPA2G1R_SCOM2P3           (PPS_RPA2G1R_RPA2G1R_SCOM2P3_Val << PPS_RPA2G1R_RPA2G1R_Pos) /* (PPS_RPA2G1R) SERCOM2/PAD3 Position */
#define PPS_RPA2G1R_RPA2G1R_SCOM2P2           (PPS_RPA2G1R_RPA2G1R_SCOM2P2_Val << PPS_RPA2G1R_RPA2G1R_Pos) /* (PPS_RPA2G1R) SERCOM2/PAD2 Position */
#define PPS_RPA2G1R_RPA2G1R_SCOM3P0           (PPS_RPA2G1R_RPA2G1R_SCOM3P0_Val << PPS_RPA2G1R_RPA2G1R_Pos) /* (PPS_RPA2G1R) SERCOM3/PAD0 Position */
#define PPS_RPA2G1R_RPA2G1R_SCOM3P2           (PPS_RPA2G1R_RPA2G1R_SCOM3P2_Val << PPS_RPA2G1R_RPA2G1R_Pos) /* (PPS_RPA2G1R) SERCOM3/PAD2 Position */
#define PPS_RPA2G1R_RPA2G1R_SCOM4P3           (PPS_RPA2G1R_RPA2G1R_SCOM4P3_Val << PPS_RPA2G1R_RPA2G1R_Pos) /* (PPS_RPA2G1R) SERCOM4/PAD3 Position */
#define PPS_RPA2G1R_RPA2G1R_SCOM4P2           (PPS_RPA2G1R_RPA2G1R_SCOM4P2_Val << PPS_RPA2G1R_RPA2G1R_Pos) /* (PPS_RPA2G1R) SERCOM4/PAD2 Position */
#define PPS_RPA2G1R_RPA2G1R_SCOM5P0           (PPS_RPA2G1R_RPA2G1R_SCOM5P0_Val << PPS_RPA2G1R_RPA2G1R_Pos) /* (PPS_RPA2G1R) SERCOM5/PAD0 Position */
#define PPS_RPA2G1R_RPA2G1R_SCOM5P2           (PPS_RPA2G1R_RPA2G1R_SCOM5P2_Val << PPS_RPA2G1R_RPA2G1R_Pos) /* (PPS_RPA2G1R) SERCOM5/PAD2 Position */
#define PPS_RPA2G1R_RPA2G1R_TCC0WO0           (PPS_RPA2G1R_RPA2G1R_TCC0WO0_Val << PPS_RPA2G1R_RPA2G1R_Pos) /* (PPS_RPA2G1R) TCC0/WO0 Position */
#define PPS_RPA2G1R_RPA2G1R_TCC0WO4           (PPS_RPA2G1R_RPA2G1R_TCC0WO4_Val << PPS_RPA2G1R_RPA2G1R_Pos) /* (PPS_RPA2G1R) TCC0/WO4 Position */
#define PPS_RPA2G1R_RPA2G1R_TCC1WO0           (PPS_RPA2G1R_RPA2G1R_TCC1WO0_Val << PPS_RPA2G1R_RPA2G1R_Pos) /* (PPS_RPA2G1R) TCC1/WO0 Position */
#define PPS_RPA2G1R_RPA2G1R_TCC1WO4           (PPS_RPA2G1R_RPA2G1R_TCC1WO4_Val << PPS_RPA2G1R_RPA2G1R_Pos) /* (PPS_RPA2G1R) TCC1/WO4 Position */
#define PPS_RPA2G1R_RPA2G1R_TCC2WO0           (PPS_RPA2G1R_RPA2G1R_TCC2WO0_Val << PPS_RPA2G1R_RPA2G1R_Pos) /* (PPS_RPA2G1R) TCC2/WO0 Position */
#define PPS_RPA2G1R_RPA2G1R_TC0WO1            (PPS_RPA2G1R_RPA2G1R_TC0WO1_Val << PPS_RPA2G1R_RPA2G1R_Pos) /* (PPS_RPA2G1R) TC0/WO1 Position */
#define PPS_RPA2G1R_RPA2G1R_TC1WO0            (PPS_RPA2G1R_RPA2G1R_TC1WO0_Val << PPS_RPA2G1R_RPA2G1R_Pos) /* (PPS_RPA2G1R) TC1/WO0 Position */
#define PPS_RPA2G1R_RPA2G1R_TC2WO0            (PPS_RPA2G1R_RPA2G1R_TC2WO0_Val << PPS_RPA2G1R_RPA2G1R_Pos) /* (PPS_RPA2G1R) TC2/WO0 Position */
#define PPS_RPA2G1R_RPA2G1R_TC3WO0            (PPS_RPA2G1R_RPA2G1R_TC3WO0_Val << PPS_RPA2G1R_RPA2G1R_Pos) /* (PPS_RPA2G1R) TC3/WO0 Position */
#define PPS_RPA2G1R_RPA2G1R_TC4WO0            (PPS_RPA2G1R_RPA2G1R_TC4WO0_Val << PPS_RPA2G1R_RPA2G1R_Pos) /* (PPS_RPA2G1R) TC4/WO0 Position */
#define PPS_RPA2G1R_RPA2G1R_TC5WO0            (PPS_RPA2G1R_RPA2G1R_TC5WO0_Val << PPS_RPA2G1R_RPA2G1R_Pos) /* (PPS_RPA2G1R) TC5/WO0 Position */
#define PPS_RPA2G1R_RPA2G1R_TC6WO0            (PPS_RPA2G1R_RPA2G1R_TC6WO0_Val << PPS_RPA2G1R_RPA2G1R_Pos) /* (PPS_RPA2G1R) TC6/WO0 Position */
#define PPS_RPA2G1R_RPA2G1R_TC7WO0            (PPS_RPA2G1R_RPA2G1R_TC7WO0_Val << PPS_RPA2G1R_RPA2G1R_Pos) /* (PPS_RPA2G1R) TC7/WO0 Position */
#define PPS_RPA2G1R_RPA2G1R_TC8WO0            (PPS_RPA2G1R_RPA2G1R_TC8WO0_Val << PPS_RPA2G1R_RPA2G1R_Pos) /* (PPS_RPA2G1R) TC8/WO0 Position */
#define PPS_RPA2G1R_RPA2G1R_QSPICS            (PPS_RPA2G1R_RPA2G1R_QSPICS_Val << PPS_RPA2G1R_RPA2G1R_Pos) /* (PPS_RPA2G1R) QSPI/CS Position */
#define PPS_RPA2G1R_RPA2G1R_QD3               (PPS_RPA2G1R_RPA2G1R_QD3_Val << PPS_RPA2G1R_RPA2G1R_Pos) /* (PPS_RPA2G1R) QSPI/DATA3 Position */
#define PPS_RPA2G1R_RPA2G1R_QD2               (PPS_RPA2G1R_RPA2G1R_QD2_Val << PPS_RPA2G1R_RPA2G1R_Pos) /* (PPS_RPA2G1R) QSPI/DATA2 Position */
#define PPS_RPA2G1R_RPA2G1R_QD1               (PPS_RPA2G1R_RPA2G1R_QD1_Val << PPS_RPA2G1R_RPA2G1R_Pos) /* (PPS_RPA2G1R) QSPI/DATA1 Position */
#define PPS_RPA2G1R_RPA2G1R_QEICCMP0          (PPS_RPA2G1R_RPA2G1R_QEICCMP0_Val << PPS_RPA2G1R_RPA2G1R_Pos) /* (PPS_RPA2G1R) QEI/CCMP0 Position */
#define PPS_RPA2G1R_RPA2G1R_TSTBUS0           (PPS_RPA2G1R_RPA2G1R_TSTBUS0_Val << PPS_RPA2G1R_RPA2G1R_Pos) /* (PPS_RPA2G1R) TSTBUS0 Position */
#define PPS_RPA2G1R_RPA2G1R_TSTBUS4           (PPS_RPA2G1R_RPA2G1R_TSTBUS4_Val << PPS_RPA2G1R_RPA2G1R_Pos) /* (PPS_RPA2G1R) TSTBUS4 Position */
#define PPS_RPA2G1R_RPA2G1R_TSTBUS8           (PPS_RPA2G1R_RPA2G1R_TSTBUS8_Val << PPS_RPA2G1R_RPA2G1R_Pos) /* (PPS_RPA2G1R) TSTBUS8 Position */
#define PPS_RPA2G1R_RPA2G1R_FECTRL1           (PPS_RPA2G1R_RPA2G1R_FECTRL1_Val << PPS_RPA2G1R_RPA2G1R_Pos) /* (PPS_RPA2G1R) FECTRL1 Position */
#define PPS_RPA2G1R_RPA2G1R_FECTRL2           (PPS_RPA2G1R_RPA2G1R_FECTRL2_Val << PPS_RPA2G1R_RPA2G1R_Pos) /* (PPS_RPA2G1R) FECTRL2 Position */
#define PPS_RPA2G1R_RPA2G1R_COEX_BT_STATE     (PPS_RPA2G1R_RPA2G1R_COEX_BT_STATE_Val << PPS_RPA2G1R_RPA2G1R_Pos) /* (PPS_RPA2G1R) COEX/BT/STATE Position */
#define PPS_RPA2G1R_Msk                       _UINT32_(0x0000003F)                                 /* (PPS_RPA2G1R) Register Mask  */


