Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/bootloader/firmware/src/packs/PIC32WM_BZ6204_DFP/component/pps.h
/* -------- PPS_RPA10G5R : (PPS Offset: 0x28C) (R/W 32)  -------- */
#define PPS_RPA10G5R_RESETVALUE               _UINT32_(0x00)                                       /*  (PPS_RPA10G5R)   Reset Value */

#define PPS_RPA10G5R_RPA10G5R_Pos             _UINT32_(0)                                          /* (PPS_RPA10G5R) RPA10/G5 Position */
#define PPS_RPA10G5R_RPA10G5R_Msk             (_UINT32_(0x3F) << PPS_RPA10G5R_RPA10G5R_Pos)        /* (PPS_RPA10G5R) RPA10/G5 Mask */
#define PPS_RPA10G5R_RPA10G5R(value)          (PPS_RPA10G5R_RPA10G5R_Msk & (_UINT32_(value) << PPS_RPA10G5R_RPA10G5R_Pos)) /* Assignment of value for RPA10G5R in the PPS_RPA10G5R register */
#define   PPS_RPA10G5R_RPA10G5R_OFF_Val       _UINT32_(0x0)                                        /* (PPS_RPA10G5R) OFF  */
#define   PPS_RPA10G5R_RPA10G5R_CCLO0_Val     _UINT32_(0x1)                                        /* (PPS_RPA10G5R) CCL/OUT0  */
#define   PPS_RPA10G5R_RPA10G5R_SCOM1P3_Val   _UINT32_(0x2)                                        /* (PPS_RPA10G5R) SERCOM1/PAD3  */
#define   PPS_RPA10G5R_RPA10G5R_SCOM2P0_Val   _UINT32_(0x3)                                        /* (PPS_RPA10G5R) SERCOM2/PAD0  */
#define   PPS_RPA10G5R_RPA10G5R_TCC0WO4_Val   _UINT32_(0x4)                                        /* (PPS_RPA10G5R) TCC0/WO4  */
#define   PPS_RPA10G5R_RPA10G5R_TCC0WO2_Val   _UINT32_(0x5)                                        /* (PPS_RPA10G5R) TCC0/WO2  */
#define   PPS_RPA10G5R_RPA10G5R_TCC0WO1_Val   _UINT32_(0x6)                                        /* (PPS_RPA10G5R) TCC0/WO1  */
#define   PPS_RPA10G5R_RPA10G5R_TCC1WO4_Val   _UINT32_(0x7)                                        /* (PPS_RPA10G5R) TCC1/WO4  */
#define   PPS_RPA10G5R_RPA10G5R_TCC1WO2_Val   _UINT32_(0x8)                                        /* (PPS_RPA10G5R) TCC1/WO2  */
#define   PPS_RPA10G5R_RPA10G5R_TCC1WO1_Val   _UINT32_(0x9)                                        /* (PPS_RPA10G5R) TCC1/WO1  */
#define   PPS_RPA10G5R_RPA10G5R_TC8WO1_Val    _UINT32_(0xA)                                        /* (PPS_RPA10G5R) TC8/WO1  */
#define   PPS_RPA10G5R_RPA10G5R_TC9WO1_Val    _UINT32_(0xB)                                        /* (PPS_RPA10G5R) TC9/WO1  */
#define   PPS_RPA10G5R_RPA10G5R_QSPICS_Val    _UINT32_(0xC)                                        /* (PPS_RPA10G5R) QSPI/CS  */
#define   PPS_RPA10G5R_RPA10G5R_QEICCMP0_Val  _UINT32_(0xD)                                        /* (PPS_RPA10G5R) QEI/CCMP0  */
#define   PPS_RPA10G5R_RPA10G5R_GMAC_TSUCOMP_Val _UINT32_(0xE)                                        /* (PPS_RPA10G5R) ETH/TSUCOMP  */
#define   PPS_RPA10G5R_RPA10G5R_TSTBUS3_Val   _UINT32_(0xF)                                        /* (PPS_RPA10G5R) TSTBUS3  */
#define   PPS_RPA10G5R_RPA10G5R_TSTBUS7_Val   _UINT32_(0x10)                                       /* (PPS_RPA10G5R) TSTBUS7  */
#define   PPS_RPA10G5R_RPA10G5R_TSTBUS11_Val  _UINT32_(0x11)                                       /* (PPS_RPA10G5R) TSTBUS11  */
#define PPS_RPA10G5R_RPA10G5R_OFF             (PPS_RPA10G5R_RPA10G5R_OFF_Val << PPS_RPA10G5R_RPA10G5R_Pos) /* (PPS_RPA10G5R) OFF Position */
#define PPS_RPA10G5R_RPA10G5R_CCLO0           (PPS_RPA10G5R_RPA10G5R_CCLO0_Val << PPS_RPA10G5R_RPA10G5R_Pos) /* (PPS_RPA10G5R) CCL/OUT0 Position */
#define PPS_RPA10G5R_RPA10G5R_SCOM1P3         (PPS_RPA10G5R_RPA10G5R_SCOM1P3_Val << PPS_RPA10G5R_RPA10G5R_Pos) /* (PPS_RPA10G5R) SERCOM1/PAD3 Position */
#define PPS_RPA10G5R_RPA10G5R_SCOM2P0         (PPS_RPA10G5R_RPA10G5R_SCOM2P0_Val << PPS_RPA10G5R_RPA10G5R_Pos) /* (PPS_RPA10G5R) SERCOM2/PAD0 Position */
#define PPS_RPA10G5R_RPA10G5R_TCC0WO4         (PPS_RPA10G5R_RPA10G5R_TCC0WO4_Val << PPS_RPA10G5R_RPA10G5R_Pos) /* (PPS_RPA10G5R) TCC0/WO4 Position */
#define PPS_RPA10G5R_RPA10G5R_TCC0WO2         (PPS_RPA10G5R_RPA10G5R_TCC0WO2_Val << PPS_RPA10G5R_RPA10G5R_Pos) /* (PPS_RPA10G5R) TCC0/WO2 Position */
#define PPS_RPA10G5R_RPA10G5R_TCC0WO1         (PPS_RPA10G5R_RPA10G5R_TCC0WO1_Val << PPS_RPA10G5R_RPA10G5R_Pos) /* (PPS_RPA10G5R) TCC0/WO1 Position */
#define PPS_RPA10G5R_RPA10G5R_TCC1WO4         (PPS_RPA10G5R_RPA10G5R_TCC1WO4_Val << PPS_RPA10G5R_RPA10G5R_Pos) /* (PPS_RPA10G5R) TCC1/WO4 Position */
#define PPS_RPA10G5R_RPA10G5R_TCC1WO2         (PPS_RPA10G5R_RPA10G5R_TCC1WO2_Val << PPS_RPA10G5R_RPA10G5R_Pos) /* (PPS_RPA10G5R) TCC1/WO2 Position */
#define PPS_RPA10G5R_RPA10G5R_TCC1WO1         (PPS_RPA10G5R_RPA10G5R_TCC1WO1_Val << PPS_RPA10G5R_RPA10G5R_Pos) /* (PPS_RPA10G5R) TCC1/WO1 Position */
#define PPS_RPA10G5R_RPA10G5R_TC8WO1          (PPS_RPA10G5R_RPA10G5R_TC8WO1_Val << PPS_RPA10G5R_RPA10G5R_Pos) /* (PPS_RPA10G5R) TC8/WO1 Position */
#define PPS_RPA10G5R_RPA10G5R_TC9WO1          (PPS_RPA10G5R_RPA10G5R_TC9WO1_Val << PPS_RPA10G5R_RPA10G5R_Pos) /* (PPS_RPA10G5R) TC9/WO1 Position */
#define PPS_RPA10G5R_RPA10G5R_QSPICS          (PPS_RPA10G5R_RPA10G5R_QSPICS_Val << PPS_RPA10G5R_RPA10G5R_Pos) /* (PPS_RPA10G5R) QSPI/CS Position */
#define PPS_RPA10G5R_RPA10G5R_QEICCMP0        (PPS_RPA10G5R_RPA10G5R_QEICCMP0_Val << PPS_RPA10G5R_RPA10G5R_Pos) /* (PPS_RPA10G5R) QEI/CCMP0 Position */
#define PPS_RPA10G5R_RPA10G5R_GMAC_TSUCOMP    (PPS_RPA10G5R_RPA10G5R_GMAC_TSUCOMP_Val << PPS_RPA10G5R_RPA10G5R_Pos) /* (PPS_RPA10G5R) ETH/TSUCOMP Position */
#define PPS_RPA10G5R_RPA10G5R_TSTBUS3         (PPS_RPA10G5R_RPA10G5R_TSTBUS3_Val << PPS_RPA10G5R_RPA10G5R_Pos) /* (PPS_RPA10G5R) TSTBUS3 Position */
#define PPS_RPA10G5R_RPA10G5R_TSTBUS7         (PPS_RPA10G5R_RPA10G5R_TSTBUS7_Val << PPS_RPA10G5R_RPA10G5R_Pos) /* (PPS_RPA10G5R) TSTBUS7 Position */
#define PPS_RPA10G5R_RPA10G5R_TSTBUS11        (PPS_RPA10G5R_RPA10G5R_TSTBUS11_Val << PPS_RPA10G5R_RPA10G5R_Pos) /* (PPS_RPA10G5R) TSTBUS11 Position */
#define PPS_RPA10G5R_Msk                      _UINT32_(0x0000003F)                                 /* (PPS_RPA10G5R) Register Mask  */


/* -------- PPS_RPA13G3R : (PPS Offset: 0x2A0) (R/W 32)  -------- */
#define PPS_RPA13G3R_RESETVALUE               _UINT32_(0x00)                                       /*  (PPS_RPA13G3R)   Reset Value */

#define PPS_RPA13G3R_RPA13G3R_Pos             _UINT32_(0)                                          /* (PPS_RPA13G3R) RPA13/G3 Position */
#define PPS_RPA13G3R_RPA13G3R_Msk             (_UINT32_(0x3F) << PPS_RPA13G3R_RPA13G3R_Pos)        /* (PPS_RPA13G3R) RPA13/G3 Mask */
#define PPS_RPA13G3R_RPA13G3R(value)          (PPS_RPA13G3R_RPA13G3R_Msk & (_UINT32_(value) << PPS_RPA13G3R_RPA13G3R_Pos)) /* Assignment of value for RPA13G3R in the PPS_RPA13G3R register */
#define   PPS_RPA13G3R_RPA13G3R_OFF_Val       _UINT32_(0x0)                                        /* (PPS_RPA13G3R) OFF  */
#define   PPS_RPA13G3R_RPA13G3R_CCLO0_Val     _UINT32_(0x1)                                        /* (PPS_RPA13G3R) CCL/OUT0  */
#define   PPS_RPA13G3R_RPA13G3R_SCOM0P0_Val   _UINT32_(0x2)                                        /* (PPS_RPA13G3R) SERCOM0/PAD0  */
#define   PPS_RPA13G3R_RPA13G3R_SCOM0P3_Val   _UINT32_(0x3)                                        /* (PPS_RPA13G3R) SERCOM0/PAD3  */
#define   PPS_RPA13G3R_RPA13G3R_SCOM1P2_Val   _UINT32_(0x4)                                        /* (PPS_RPA13G3R) SERCOM1/PAD2  */
#define   PPS_RPA13G3R_RPA13G3R_SCOM1P0_Val   _UINT32_(0x5)                                        /* (PPS_RPA13G3R) SERCOM1/PAD0  */
#define   PPS_RPA13G3R_RPA13G3R_SCOM1P3_Val   _UINT32_(0x6)                                        /* (PPS_RPA13G3R) SERCOM1/PAD3  */
#define   PPS_RPA13G3R_RPA13G3R_SCOM2P0_Val   _UINT32_(0x7)                                        /* (PPS_RPA13G3R) SERCOM2/PAD0  */
#define   PPS_RPA13G3R_RPA13G3R_SCOM2P3_Val   _UINT32_(0x8)                                        /* (PPS_RPA13G3R) SERCOM2/PAD3  */
#define   PPS_RPA13G3R_RPA13G3R_SCOM3P2_Val   _UINT32_(0x9)                                        /* (PPS_RPA13G3R) SERCOM3/PAD2  */
#define   PPS_RPA13G3R_RPA13G3R_SCOM3P0_Val   _UINT32_(0xA)                                        /* (PPS_RPA13G3R) SERCOM3/PAD0  */
#define   PPS_RPA13G3R_RPA13G3R_SCOM3P3_Val   _UINT32_(0xB)                                        /* (PPS_RPA13G3R) SERCOM3/PAD3  */
#define   PPS_RPA13G3R_RPA13G3R_SCOM4P0_Val   _UINT32_(0xC)                                        /* (PPS_RPA13G3R) SERCOM4/PAD0  */
#define   PPS_RPA13G3R_RPA13G3R_SCOM4P3_Val   _UINT32_(0xD)                                        /* (PPS_RPA13G3R) SERCOM4/PAD3  */
#define   PPS_RPA13G3R_RPA13G3R_SCOM5P2_Val   _UINT32_(0xE)                                        /* (PPS_RPA13G3R) SERCOM5/PAD2  */
#define   PPS_RPA13G3R_RPA13G3R_SCOM5P0_Val   _UINT32_(0xF)                                        /* (PPS_RPA13G3R) SERCOM5/PAD0  */
#define   PPS_RPA13G3R_RPA13G3R_SCOM5P3_Val   _UINT32_(0x10)                                       /* (PPS_RPA13G3R) SERCOM5/PAD3  */
#define   PPS_RPA13G3R_RPA13G3R_TCC0WO2_Val   _UINT32_(0x11)                                       /* (PPS_RPA13G3R) TCC0/WO2  */
#define   PPS_RPA13G3R_RPA13G3R_TCC0WO0_Val   _UINT32_(0x12)                                       /* (PPS_RPA13G3R) TCC0/WO0  */
#define   PPS_RPA13G3R_RPA13G3R_TCC0WO4_Val   _UINT32_(0x13)                                       /* (PPS_RPA13G3R) TCC0/WO4  */
#define   PPS_RPA13G3R_RPA13G3R_TCC1WO2_Val   _UINT32_(0x14)                                       /* (PPS_RPA13G3R) TCC1/WO2  */
#define   PPS_RPA13G3R_RPA13G3R_TCC1WO0_Val   _UINT32_(0x15)                                       /* (PPS_RPA13G3R) TCC1/WO0  */
#define   PPS_RPA13G3R_RPA13G3R_TCC1WO4_Val   _UINT32_(0x16)                                       /* (PPS_RPA13G3R) TCC1/WO4  */
#define   PPS_RPA13G3R_RPA13G3R_TCC2WO0_Val   _UINT32_(0x17)                                       /* (PPS_RPA13G3R) TCC2/WO0  */
#define   PPS_RPA13G3R_RPA13G3R_TC0WO0_Val    _UINT32_(0x18)                                       /* (PPS_RPA13G3R) TC0/WO0  */
#define   PPS_RPA13G3R_RPA13G3R_TC1WO0_Val    _UINT32_(0x19)                                       /* (PPS_RPA13G3R) TC1/WO0  */
#define   PPS_RPA13G3R_RPA13G3R_TC2WO0_Val    _UINT32_(0x1A)                                       /* (PPS_RPA13G3R) TC2/WO0  */
#define   PPS_RPA13G3R_RPA13G3R_TC3WO0_Val    _UINT32_(0x1B)                                       /* (PPS_RPA13G3R) TC3/WO0  */
#define   PPS_RPA13G3R_RPA13G3R_TC4WO0_Val    _UINT32_(0x1C)                                       /* (PPS_RPA13G3R) TC4/WO0  */
#define   PPS_RPA13G3R_RPA13G3R_TC5WO0_Val    _UINT32_(0x1D)                                       /* (PPS_RPA13G3R) TC5/WO0  */
#define   PPS_RPA13G3R_RPA13G3R_TC6WO0_Val    _UINT32_(0x1E)                                       /* (PPS_RPA13G3R) TC6/WO0  */
#define   PPS_RPA13G3R_RPA13G3R_TC7WO0_Val    _UINT32_(0x1F)                                       /* (PPS_RPA13G3R) TC7/WO0  */
#define   PPS_RPA13G3R_RPA13G3R_TC8WO0_Val    _UINT32_(0x20)                                       /* (PPS_RPA13G3R) TC8/WO0  */
#define   PPS_RPA13G3R_RPA13G3R_TC9WO1_Val    _UINT32_(0x21)                                       /* (PPS_RPA13G3R) TC9/WO1  */
#define   PPS_RPA13G3R_RPA13G3R_QSPICS_Val    _UINT32_(0x22)                                       /* (PPS_RPA13G3R) QSPI/CS  */
#define   PPS_RPA13G3R_RPA13G3R_QD1_Val       _UINT32_(0x23)                                       /* (PPS_RPA13G3R) QSPI/DATA1  */
#define   PPS_RPA13G3R_RPA13G3R_QD0_Val       _UINT32_(0x24)                                       /* (PPS_RPA13G3R) QSPI/DATA0  */
#define   PPS_RPA13G3R_RPA13G3R_QD3_Val       _UINT32_(0x25)                                       /* (PPS_RPA13G3R) QSPI/DATA3  */
#define   PPS_RPA13G3R_RPA13G3R_TSTBUS1_Val   _UINT32_(0x26)                                       /* (PPS_RPA13G3R) TSTBUS1  */
#define   PPS_RPA13G3R_RPA13G3R_TSTBUS10_Val  _UINT32_(0x27)                                       /* (PPS_RPA13G3R) TSTBUS10  */
#define   PPS_RPA13G3R_RPA13G3R_AC_CMP0_Val   _UINT32_(0x28)                                       /* (PPS_RPA13G3R) AC/CMP0  */
#define   PPS_RPA13G3R_RPA13G3R_AC_CMPTRDY_Val _UINT32_(0x29)                                       /* (PPS_RPA13G3R) AC/CMPTRDY  */
#define   PPS_RPA13G3R_RPA13G3R_FECTRL4_Val   _UINT32_(0x2A)                                       /* (PPS_RPA13G3R) FECTRL4  */
#define PPS_RPA13G3R_RPA13G3R_OFF             (PPS_RPA13G3R_RPA13G3R_OFF_Val << PPS_RPA13G3R_RPA13G3R_Pos) /* (PPS_RPA13G3R) OFF Position */
#define PPS_RPA13G3R_RPA13G3R_CCLO0           (PPS_RPA13G3R_RPA13G3R_CCLO0_Val << PPS_RPA13G3R_RPA13G3R_Pos) /* (PPS_RPA13G3R) CCL/OUT0 Position */
#define PPS_RPA13G3R_RPA13G3R_SCOM0P0         (PPS_RPA13G3R_RPA13G3R_SCOM0P0_Val << PPS_RPA13G3R_RPA13G3R_Pos) /* (PPS_RPA13G3R) SERCOM0/PAD0 Position */
#define PPS_RPA13G3R_RPA13G3R_SCOM0P3         (PPS_RPA13G3R_RPA13G3R_SCOM0P3_Val << PPS_RPA13G3R_RPA13G3R_Pos) /* (PPS_RPA13G3R) SERCOM0/PAD3 Position */
#define PPS_RPA13G3R_RPA13G3R_SCOM1P2         (PPS_RPA13G3R_RPA13G3R_SCOM1P2_Val << PPS_RPA13G3R_RPA13G3R_Pos) /* (PPS_RPA13G3R) SERCOM1/PAD2 Position */
#define PPS_RPA13G3R_RPA13G3R_SCOM1P0         (PPS_RPA13G3R_RPA13G3R_SCOM1P0_Val << PPS_RPA13G3R_RPA13G3R_Pos) /* (PPS_RPA13G3R) SERCOM1/PAD0 Position */
#define PPS_RPA13G3R_RPA13G3R_SCOM1P3         (PPS_RPA13G3R_RPA13G3R_SCOM1P3_Val << PPS_RPA13G3R_RPA13G3R_Pos) /* (PPS_RPA13G3R) SERCOM1/PAD3 Position */
#define PPS_RPA13G3R_RPA13G3R_SCOM2P0         (PPS_RPA13G3R_RPA13G3R_SCOM2P0_Val << PPS_RPA13G3R_RPA13G3R_Pos) /* (PPS_RPA13G3R) SERCOM2/PAD0 Position */
#define PPS_RPA13G3R_RPA13G3R_SCOM2P3         (PPS_RPA13G3R_RPA13G3R_SCOM2P3_Val << PPS_RPA13G3R_RPA13G3R_Pos) /* (PPS_RPA13G3R) SERCOM2/PAD3 Position */
#define PPS_RPA13G3R_RPA13G3R_SCOM3P2         (PPS_RPA13G3R_RPA13G3R_SCOM3P2_Val << PPS_RPA13G3R_RPA13G3R_Pos) /* (PPS_RPA13G3R) SERCOM3/PAD2 Position */
#define PPS_RPA13G3R_RPA13G3R_SCOM3P0         (PPS_RPA13G3R_RPA13G3R_SCOM3P0_Val << PPS_RPA13G3R_RPA13G3R_Pos) /* (PPS_RPA13G3R) SERCOM3/PAD0 Position */
#define PPS_RPA13G3R_RPA13G3R_SCOM3P3         (PPS_RPA13G3R_RPA13G3R_SCOM3P3_Val << PPS_RPA13G3R_RPA13G3R_Pos) /* (PPS_RPA13G3R) SERCOM3/PAD3 Position */
#define PPS_RPA13G3R_RPA13G3R_SCOM4P0         (PPS_RPA13G3R_RPA13G3R_SCOM4P0_Val << PPS_RPA13G3R_RPA13G3R_Pos) /* (PPS_RPA13G3R) SERCOM4/PAD0 Position */
#define PPS_RPA13G3R_RPA13G3R_SCOM4P3         (PPS_RPA13G3R_RPA13G3R_SCOM4P3_Val << PPS_RPA13G3R_RPA13G3R_Pos) /* (PPS_RPA13G3R) SERCOM4/PAD3 Position */
#define PPS_RPA13G3R_RPA13G3R_SCOM5P2         (PPS_RPA13G3R_RPA13G3R_SCOM5P2_Val << PPS_RPA13G3R_RPA13G3R_Pos) /* (PPS_RPA13G3R) SERCOM5/PAD2 Position */
#define PPS_RPA13G3R_RPA13G3R_SCOM5P0         (PPS_RPA13G3R_RPA13G3R_SCOM5P0_Val << PPS_RPA13G3R_RPA13G3R_Pos) /* (PPS_RPA13G3R) SERCOM5/PAD0 Position */
#define PPS_RPA13G3R_RPA13G3R_SCOM5P3         (PPS_RPA13G3R_RPA13G3R_SCOM5P3_Val << PPS_RPA13G3R_RPA13G3R_Pos) /* (PPS_RPA13G3R) SERCOM5/PAD3 Position */
#define PPS_RPA13G3R_RPA13G3R_TCC0WO2         (PPS_RPA13G3R_RPA13G3R_TCC0WO2_Val << PPS_RPA13G3R_RPA13G3R_Pos) /* (PPS_RPA13G3R) TCC0/WO2 Position */
#define PPS_RPA13G3R_RPA13G3R_TCC0WO0         (PPS_RPA13G3R_RPA13G3R_TCC0WO0_Val << PPS_RPA13G3R_RPA13G3R_Pos) /* (PPS_RPA13G3R) TCC0/WO0 Position */
#define PPS_RPA13G3R_RPA13G3R_TCC0WO4         (PPS_RPA13G3R_RPA13G3R_TCC0WO4_Val << PPS_RPA13G3R_RPA13G3R_Pos) /* (PPS_RPA13G3R) TCC0/WO4 Position */
#define PPS_RPA13G3R_RPA13G3R_TCC1WO2         (PPS_RPA13G3R_RPA13G3R_TCC1WO2_Val << PPS_RPA13G3R_RPA13G3R_Pos) /* (PPS_RPA13G3R) TCC1/WO2 Position */
#define PPS_RPA13G3R_RPA13G3R_TCC1WO0         (PPS_RPA13G3R_RPA13G3R_TCC1WO0_Val << PPS_RPA13G3R_RPA13G3R_Pos) /* (PPS_RPA13G3R) TCC1/WO0 Position */
#define PPS_RPA13G3R_RPA13G3R_TCC1WO4         (PPS_RPA13G3R_RPA13G3R_TCC1WO4_Val << PPS_RPA13G3R_RPA13G3R_Pos) /* (PPS_RPA13G3R) TCC1/WO4 Position */
#define PPS_RPA13G3R_RPA13G3R_TCC2WO0         (PPS_RPA13G3R_RPA13G3R_TCC2WO0_Val << PPS_RPA13G3R_RPA13G3R_Pos) /* (PPS_RPA13G3R) TCC2/WO0 Position */
#define PPS_RPA13G3R_RPA13G3R_TC0WO0          (PPS_RPA13G3R_RPA13G3R_TC0WO0_Val << PPS_RPA13G3R_RPA13G3R_Pos) /* (PPS_RPA13G3R) TC0/WO0 Position */
#define PPS_RPA13G3R_RPA13G3R_TC1WO0          (PPS_RPA13G3R_RPA13G3R_TC1WO0_Val << PPS_RPA13G3R_RPA13G3R_Pos) /* (PPS_RPA13G3R) TC1/WO0 Position */
#define PPS_RPA13G3R_RPA13G3R_TC2WO0          (PPS_RPA13G3R_RPA13G3R_TC2WO0_Val << PPS_RPA13G3R_RPA13G3R_Pos) /* (PPS_RPA13G3R) TC2/WO0 Position */
#define PPS_RPA13G3R_RPA13G3R_TC3WO0          (PPS_RPA13G3R_RPA13G3R_TC3WO0_Val << PPS_RPA13G3R_RPA13G3R_Pos) /* (PPS_RPA13G3R) TC3/WO0 Position */
#define PPS_RPA13G3R_RPA13G3R_TC4WO0          (PPS_RPA13G3R_RPA13G3R_TC4WO0_Val << PPS_RPA13G3R_RPA13G3R_Pos) /* (PPS_RPA13G3R) TC4/WO0 Position */
#define PPS_RPA13G3R_RPA13G3R_TC5WO0          (PPS_RPA13G3R_RPA13G3R_TC5WO0_Val << PPS_RPA13G3R_RPA13G3R_Pos) /* (PPS_RPA13G3R) TC5/WO0 Position */
#define PPS_RPA13G3R_RPA13G3R_TC6WO0          (PPS_RPA13G3R_RPA13G3R_TC6WO0_Val << PPS_RPA13G3R_RPA13G3R_Pos) /* (PPS_RPA13G3R) TC6/WO0 Position */
#define PPS_RPA13G3R_RPA13G3R_TC7WO0          (PPS_RPA13G3R_RPA13G3R_TC7WO0_Val << PPS_RPA13G3R_RPA13G3R_Pos) /* (PPS_RPA13G3R) TC7/WO0 Position */
#define PPS_RPA13G3R_RPA13G3R_TC8WO0          (PPS_RPA13G3R_RPA13G3R_TC8WO0_Val << PPS_RPA13G3R_RPA13G3R_Pos) /* (PPS_RPA13G3R) TC8/WO0 Position */
#define PPS_RPA13G3R_RPA13G3R_TC9WO1          (PPS_RPA13G3R_RPA13G3R_TC9WO1_Val << PPS_RPA13G3R_RPA13G3R_Pos) /* (PPS_RPA13G3R) TC9/WO1 Position */
#define PPS_RPA13G3R_RPA13G3R_QSPICS          (PPS_RPA13G3R_RPA13G3R_QSPICS_Val << PPS_RPA13G3R_RPA13G3R_Pos) /* (PPS_RPA13G3R) QSPI/CS Position */
#define PPS_RPA13G3R_RPA13G3R_QD1             (PPS_RPA13G3R_RPA13G3R_QD1_Val << PPS_RPA13G3R_RPA13G3R_Pos) /* (PPS_RPA13G3R) QSPI/DATA1 Position */
#define PPS_RPA13G3R_RPA13G3R_QD0             (PPS_RPA13G3R_RPA13G3R_QD0_Val << PPS_RPA13G3R_RPA13G3R_Pos) /* (PPS_RPA13G3R) QSPI/DATA0 Position */
#define PPS_RPA13G3R_RPA13G3R_QD3             (PPS_RPA13G3R_RPA13G3R_QD3_Val << PPS_RPA13G3R_RPA13G3R_Pos) /* (PPS_RPA13G3R) QSPI/DATA3 Position */
#define PPS_RPA13G3R_RPA13G3R_TSTBUS1         (PPS_RPA13G3R_RPA13G3R_TSTBUS1_Val << PPS_RPA13G3R_RPA13G3R_Pos) /* (PPS_RPA13G3R) TSTBUS1 Position */
#define PPS_RPA13G3R_RPA13G3R_TSTBUS10        (PPS_RPA13G3R_RPA13G3R_TSTBUS10_Val << PPS_RPA13G3R_RPA13G3R_Pos) /* (PPS_RPA13G3R) TSTBUS10 Position */
#define PPS_RPA13G3R_RPA13G3R_AC_CMP0         (PPS_RPA13G3R_RPA13G3R_AC_CMP0_Val << PPS_RPA13G3R_RPA13G3R_Pos) /* (PPS_RPA13G3R) AC/CMP0 Position */
#define PPS_RPA13G3R_RPA13G3R_AC_CMPTRDY      (PPS_RPA13G3R_RPA13G3R_AC_CMPTRDY_Val << PPS_RPA13G3R_RPA13G3R_Pos) /* (PPS_RPA13G3R) AC/CMPTRDY Position */
#define PPS_RPA13G3R_RPA13G3R_FECTRL4         (PPS_RPA13G3R_RPA13G3R_FECTRL4_Val << PPS_RPA13G3R_RPA13G3R_Pos) /* (PPS_RPA13G3R) FECTRL4 Position */
#define PPS_RPA13G3R_Msk                      _UINT32_(0x0000003F)                                 /* (PPS_RPA13G3R) Register Mask  */


