Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/bootloader/firmware/src/packs/PIC32WM_BZ6204_DFP/component/pps.h
/* -------- PPS_RPC10G5R : (PPS Offset: 0x3A0) (R/W 32)  -------- */
#define PPS_RPC10G5R_RESETVALUE               _UINT32_(0x00)                                       /*  (PPS_RPC10G5R)   Reset Value */

#define PPS_RPC10G5R_RPC10G5R_Pos             _UINT32_(0)                                          /* (PPS_RPC10G5R) RPC10/G5 Position */
#define PPS_RPC10G5R_RPC10G5R_Msk             (_UINT32_(0x3F) << PPS_RPC10G5R_RPC10G5R_Pos)        /* (PPS_RPC10G5R) RPC10/G5 Mask */
#define PPS_RPC10G5R_RPC10G5R(value)          (PPS_RPC10G5R_RPC10G5R_Msk & (_UINT32_(value) << PPS_RPC10G5R_RPC10G5R_Pos)) /* Assignment of value for RPC10G5R in the PPS_RPC10G5R register */
#define   PPS_RPC10G5R_RPC10G5R_OFF_Val       _UINT32_(0x0)                                        /* (PPS_RPC10G5R) OFF  */
#define   PPS_RPC10G5R_RPC10G5R_CCLO0_Val     _UINT32_(0x1)                                        /* (PPS_RPC10G5R) CCL/OUT0  */
#define   PPS_RPC10G5R_RPC10G5R_SCOM1P3_Val   _UINT32_(0x2)                                        /* (PPS_RPC10G5R) SERCOM1/PAD3  */
#define   PPS_RPC10G5R_RPC10G5R_SCOM2P0_Val   _UINT32_(0x3)                                        /* (PPS_RPC10G5R) SERCOM2/PAD0  */
#define   PPS_RPC10G5R_RPC10G5R_TCC0WO4_Val   _UINT32_(0x4)                                        /* (PPS_RPC10G5R) TCC0/WO4  */
#define   PPS_RPC10G5R_RPC10G5R_TCC0WO2_Val   _UINT32_(0x5)                                        /* (PPS_RPC10G5R) TCC0/WO2  */
#define   PPS_RPC10G5R_RPC10G5R_TCC0WO1_Val   _UINT32_(0x6)                                        /* (PPS_RPC10G5R) TCC0/WO1  */
#define   PPS_RPC10G5R_RPC10G5R_TCC1WO4_Val   _UINT32_(0x7)                                        /* (PPS_RPC10G5R) TCC1/WO4  */
#define   PPS_RPC10G5R_RPC10G5R_TCC1WO2_Val   _UINT32_(0x8)                                        /* (PPS_RPC10G5R) TCC1/WO2  */
#define   PPS_RPC10G5R_RPC10G5R_TCC1WO1_Val   _UINT32_(0x9)                                        /* (PPS_RPC10G5R) TCC1/WO1  */
#define   PPS_RPC10G5R_RPC10G5R_TC8WO1_Val    _UINT32_(0xA)                                        /* (PPS_RPC10G5R) TC8/WO1  */
#define   PPS_RPC10G5R_RPC10G5R_TC9WO1_Val    _UINT32_(0xB)                                        /* (PPS_RPC10G5R) TC9/WO1  */
#define   PPS_RPC10G5R_RPC10G5R_QSPICS_Val    _UINT32_(0xC)                                        /* (PPS_RPC10G5R) QSPI/CS  */
#define   PPS_RPC10G5R_RPC10G5R_QEICCMP0_Val  _UINT32_(0xD)                                        /* (PPS_RPC10G5R) QEI/CCMP0  */
#define   PPS_RPC10G5R_RPC10G5R_GMAC_TSUCOMP_Val _UINT32_(0xE)                                        /* (PPS_RPC10G5R) ETH/TSUCOMP  */
#define   PPS_RPC10G5R_RPC10G5R_TSTBUS3_Val   _UINT32_(0xF)                                        /* (PPS_RPC10G5R) TSTBUS3  */
#define   PPS_RPC10G5R_RPC10G5R_TSTBUS7_Val   _UINT32_(0x10)                                       /* (PPS_RPC10G5R) TSTBUS7  */
#define   PPS_RPC10G5R_RPC10G5R_TSTBUS11_Val  _UINT32_(0x11)                                       /* (PPS_RPC10G5R) TSTBUS11  */
#define PPS_RPC10G5R_RPC10G5R_OFF             (PPS_RPC10G5R_RPC10G5R_OFF_Val << PPS_RPC10G5R_RPC10G5R_Pos) /* (PPS_RPC10G5R) OFF Position */
#define PPS_RPC10G5R_RPC10G5R_CCLO0           (PPS_RPC10G5R_RPC10G5R_CCLO0_Val << PPS_RPC10G5R_RPC10G5R_Pos) /* (PPS_RPC10G5R) CCL/OUT0 Position */
#define PPS_RPC10G5R_RPC10G5R_SCOM1P3         (PPS_RPC10G5R_RPC10G5R_SCOM1P3_Val << PPS_RPC10G5R_RPC10G5R_Pos) /* (PPS_RPC10G5R) SERCOM1/PAD3 Position */
#define PPS_RPC10G5R_RPC10G5R_SCOM2P0         (PPS_RPC10G5R_RPC10G5R_SCOM2P0_Val << PPS_RPC10G5R_RPC10G5R_Pos) /* (PPS_RPC10G5R) SERCOM2/PAD0 Position */
#define PPS_RPC10G5R_RPC10G5R_TCC0WO4         (PPS_RPC10G5R_RPC10G5R_TCC0WO4_Val << PPS_RPC10G5R_RPC10G5R_Pos) /* (PPS_RPC10G5R) TCC0/WO4 Position */
#define PPS_RPC10G5R_RPC10G5R_TCC0WO2         (PPS_RPC10G5R_RPC10G5R_TCC0WO2_Val << PPS_RPC10G5R_RPC10G5R_Pos) /* (PPS_RPC10G5R) TCC0/WO2 Position */
#define PPS_RPC10G5R_RPC10G5R_TCC0WO1         (PPS_RPC10G5R_RPC10G5R_TCC0WO1_Val << PPS_RPC10G5R_RPC10G5R_Pos) /* (PPS_RPC10G5R) TCC0/WO1 Position */
#define PPS_RPC10G5R_RPC10G5R_TCC1WO4         (PPS_RPC10G5R_RPC10G5R_TCC1WO4_Val << PPS_RPC10G5R_RPC10G5R_Pos) /* (PPS_RPC10G5R) TCC1/WO4 Position */
#define PPS_RPC10G5R_RPC10G5R_TCC1WO2         (PPS_RPC10G5R_RPC10G5R_TCC1WO2_Val << PPS_RPC10G5R_RPC10G5R_Pos) /* (PPS_RPC10G5R) TCC1/WO2 Position */
#define PPS_RPC10G5R_RPC10G5R_TCC1WO1         (PPS_RPC10G5R_RPC10G5R_TCC1WO1_Val << PPS_RPC10G5R_RPC10G5R_Pos) /* (PPS_RPC10G5R) TCC1/WO1 Position */
#define PPS_RPC10G5R_RPC10G5R_TC8WO1          (PPS_RPC10G5R_RPC10G5R_TC8WO1_Val << PPS_RPC10G5R_RPC10G5R_Pos) /* (PPS_RPC10G5R) TC8/WO1 Position */
#define PPS_RPC10G5R_RPC10G5R_TC9WO1          (PPS_RPC10G5R_RPC10G5R_TC9WO1_Val << PPS_RPC10G5R_RPC10G5R_Pos) /* (PPS_RPC10G5R) TC9/WO1 Position */
#define PPS_RPC10G5R_RPC10G5R_QSPICS          (PPS_RPC10G5R_RPC10G5R_QSPICS_Val << PPS_RPC10G5R_RPC10G5R_Pos) /* (PPS_RPC10G5R) QSPI/CS Position */
#define PPS_RPC10G5R_RPC10G5R_QEICCMP0        (PPS_RPC10G5R_RPC10G5R_QEICCMP0_Val << PPS_RPC10G5R_RPC10G5R_Pos) /* (PPS_RPC10G5R) QEI/CCMP0 Position */
#define PPS_RPC10G5R_RPC10G5R_GMAC_TSUCOMP    (PPS_RPC10G5R_RPC10G5R_GMAC_TSUCOMP_Val << PPS_RPC10G5R_RPC10G5R_Pos) /* (PPS_RPC10G5R) ETH/TSUCOMP Position */
#define PPS_RPC10G5R_RPC10G5R_TSTBUS3         (PPS_RPC10G5R_RPC10G5R_TSTBUS3_Val << PPS_RPC10G5R_RPC10G5R_Pos) /* (PPS_RPC10G5R) TSTBUS3 Position */
#define PPS_RPC10G5R_RPC10G5R_TSTBUS7         (PPS_RPC10G5R_RPC10G5R_TSTBUS7_Val << PPS_RPC10G5R_RPC10G5R_Pos) /* (PPS_RPC10G5R) TSTBUS7 Position */
#define PPS_RPC10G5R_RPC10G5R_TSTBUS11        (PPS_RPC10G5R_RPC10G5R_TSTBUS11_Val << PPS_RPC10G5R_RPC10G5R_Pos) /* (PPS_RPC10G5R) TSTBUS11 Position */
#define PPS_RPC10G5R_Msk                      _UINT32_(0x0000003F)                                 /* (PPS_RPC10G5R) Register Mask  */


/* -------- PPS_RPC11G5R : (PPS Offset: 0x3A4) (R/W 32)  -------- */
#define PPS_RPC11G5R_RESETVALUE               _UINT32_(0x00)                                       /*  (PPS_RPC11G5R)   Reset Value */

#define PPS_RPC11G5R_RPC11G5R_Pos             _UINT32_(0)                                          /* (PPS_RPC11G5R) RPC11/G5 Position */
#define PPS_RPC11G5R_RPC11G5R_Msk             (_UINT32_(0x3F) << PPS_RPC11G5R_RPC11G5R_Pos)        /* (PPS_RPC11G5R) RPC11/G5 Mask */
#define PPS_RPC11G5R_RPC11G5R(value)          (PPS_RPC11G5R_RPC11G5R_Msk & (_UINT32_(value) << PPS_RPC11G5R_RPC11G5R_Pos)) /* Assignment of value for RPC11G5R in the PPS_RPC11G5R register */
#define   PPS_RPC11G5R_RPC11G5R_OFF_Val       _UINT32_(0x0)                                        /* (PPS_RPC11G5R) OFF  */
#define   PPS_RPC11G5R_RPC11G5R_CCLO0_Val     _UINT32_(0x1)                                        /* (PPS_RPC11G5R) CCL/OUT0  */
#define   PPS_RPC11G5R_RPC11G5R_SCOM1P3_Val   _UINT32_(0x2)                                        /* (PPS_RPC11G5R) SERCOM1/PAD3  */
#define   PPS_RPC11G5R_RPC11G5R_SCOM2P0_Val   _UINT32_(0x3)                                        /* (PPS_RPC11G5R) SERCOM2/PAD0  */
#define   PPS_RPC11G5R_RPC11G5R_TCC0WO4_Val   _UINT32_(0x4)                                        /* (PPS_RPC11G5R) TCC0/WO4  */
#define   PPS_RPC11G5R_RPC11G5R_TCC0WO2_Val   _UINT32_(0x5)                                        /* (PPS_RPC11G5R) TCC0/WO2  */
#define   PPS_RPC11G5R_RPC11G5R_TCC0WO1_Val   _UINT32_(0x6)                                        /* (PPS_RPC11G5R) TCC0/WO1  */
#define   PPS_RPC11G5R_RPC11G5R_TCC1WO4_Val   _UINT32_(0x7)                                        /* (PPS_RPC11G5R) TCC1/WO4  */
#define   PPS_RPC11G5R_RPC11G5R_TCC1WO2_Val   _UINT32_(0x8)                                        /* (PPS_RPC11G5R) TCC1/WO2  */
#define   PPS_RPC11G5R_RPC11G5R_TCC1WO1_Val   _UINT32_(0x9)                                        /* (PPS_RPC11G5R) TCC1/WO1  */
#define   PPS_RPC11G5R_RPC11G5R_TC8WO1_Val    _UINT32_(0xA)                                        /* (PPS_RPC11G5R) TC8/WO1  */
#define   PPS_RPC11G5R_RPC11G5R_TC9WO1_Val    _UINT32_(0xB)                                        /* (PPS_RPC11G5R) TC9/WO1  */
#define   PPS_RPC11G5R_RPC11G5R_QSPICS_Val    _UINT32_(0xC)                                        /* (PPS_RPC11G5R) QSPI/CS  */
#define   PPS_RPC11G5R_RPC11G5R_QEICCMP0_Val  _UINT32_(0xD)                                        /* (PPS_RPC11G5R) QEI/CCMP0  */
#define   PPS_RPC11G5R_RPC11G5R_GMAC_TSUCOMP_Val _UINT32_(0xE)                                        /* (PPS_RPC11G5R) ETH/TSUCOMP  */
#define   PPS_RPC11G5R_RPC11G5R_TSTBUS3_Val   _UINT32_(0xF)                                        /* (PPS_RPC11G5R) TSTBUS3  */
#define   PPS_RPC11G5R_RPC11G5R_TSTBUS7_Val   _UINT32_(0x10)                                       /* (PPS_RPC11G5R) TSTBUS7  */
#define   PPS_RPC11G5R_RPC11G5R_TSTBUS11_Val  _UINT32_(0x11)                                       /* (PPS_RPC11G5R) TSTBUS11  */
#define PPS_RPC11G5R_RPC11G5R_OFF             (PPS_RPC11G5R_RPC11G5R_OFF_Val << PPS_RPC11G5R_RPC11G5R_Pos) /* (PPS_RPC11G5R) OFF Position */
#define PPS_RPC11G5R_RPC11G5R_CCLO0           (PPS_RPC11G5R_RPC11G5R_CCLO0_Val << PPS_RPC11G5R_RPC11G5R_Pos) /* (PPS_RPC11G5R) CCL/OUT0 Position */
#define PPS_RPC11G5R_RPC11G5R_SCOM1P3         (PPS_RPC11G5R_RPC11G5R_SCOM1P3_Val << PPS_RPC11G5R_RPC11G5R_Pos) /* (PPS_RPC11G5R) SERCOM1/PAD3 Position */
#define PPS_RPC11G5R_RPC11G5R_SCOM2P0         (PPS_RPC11G5R_RPC11G5R_SCOM2P0_Val << PPS_RPC11G5R_RPC11G5R_Pos) /* (PPS_RPC11G5R) SERCOM2/PAD0 Position */
#define PPS_RPC11G5R_RPC11G5R_TCC0WO4         (PPS_RPC11G5R_RPC11G5R_TCC0WO4_Val << PPS_RPC11G5R_RPC11G5R_Pos) /* (PPS_RPC11G5R) TCC0/WO4 Position */
#define PPS_RPC11G5R_RPC11G5R_TCC0WO2         (PPS_RPC11G5R_RPC11G5R_TCC0WO2_Val << PPS_RPC11G5R_RPC11G5R_Pos) /* (PPS_RPC11G5R) TCC0/WO2 Position */
#define PPS_RPC11G5R_RPC11G5R_TCC0WO1         (PPS_RPC11G5R_RPC11G5R_TCC0WO1_Val << PPS_RPC11G5R_RPC11G5R_Pos) /* (PPS_RPC11G5R) TCC0/WO1 Position */
#define PPS_RPC11G5R_RPC11G5R_TCC1WO4         (PPS_RPC11G5R_RPC11G5R_TCC1WO4_Val << PPS_RPC11G5R_RPC11G5R_Pos) /* (PPS_RPC11G5R) TCC1/WO4 Position */
#define PPS_RPC11G5R_RPC11G5R_TCC1WO2         (PPS_RPC11G5R_RPC11G5R_TCC1WO2_Val << PPS_RPC11G5R_RPC11G5R_Pos) /* (PPS_RPC11G5R) TCC1/WO2 Position */
#define PPS_RPC11G5R_RPC11G5R_TCC1WO1         (PPS_RPC11G5R_RPC11G5R_TCC1WO1_Val << PPS_RPC11G5R_RPC11G5R_Pos) /* (PPS_RPC11G5R) TCC1/WO1 Position */
#define PPS_RPC11G5R_RPC11G5R_TC8WO1          (PPS_RPC11G5R_RPC11G5R_TC8WO1_Val << PPS_RPC11G5R_RPC11G5R_Pos) /* (PPS_RPC11G5R) TC8/WO1 Position */
#define PPS_RPC11G5R_RPC11G5R_TC9WO1          (PPS_RPC11G5R_RPC11G5R_TC9WO1_Val << PPS_RPC11G5R_RPC11G5R_Pos) /* (PPS_RPC11G5R) TC9/WO1 Position */
#define PPS_RPC11G5R_RPC11G5R_QSPICS          (PPS_RPC11G5R_RPC11G5R_QSPICS_Val << PPS_RPC11G5R_RPC11G5R_Pos) /* (PPS_RPC11G5R) QSPI/CS Position */
#define PPS_RPC11G5R_RPC11G5R_QEICCMP0        (PPS_RPC11G5R_RPC11G5R_QEICCMP0_Val << PPS_RPC11G5R_RPC11G5R_Pos) /* (PPS_RPC11G5R) QEI/CCMP0 Position */
#define PPS_RPC11G5R_RPC11G5R_GMAC_TSUCOMP    (PPS_RPC11G5R_RPC11G5R_GMAC_TSUCOMP_Val << PPS_RPC11G5R_RPC11G5R_Pos) /* (PPS_RPC11G5R) ETH/TSUCOMP Position */
#define PPS_RPC11G5R_RPC11G5R_TSTBUS3         (PPS_RPC11G5R_RPC11G5R_TSTBUS3_Val << PPS_RPC11G5R_RPC11G5R_Pos) /* (PPS_RPC11G5R) TSTBUS3 Position */
#define PPS_RPC11G5R_RPC11G5R_TSTBUS7         (PPS_RPC11G5R_RPC11G5R_TSTBUS7_Val << PPS_RPC11G5R_RPC11G5R_Pos) /* (PPS_RPC11G5R) TSTBUS7 Position */
#define PPS_RPC11G5R_RPC11G5R_TSTBUS11        (PPS_RPC11G5R_RPC11G5R_TSTBUS11_Val << PPS_RPC11G5R_RPC11G5R_Pos) /* (PPS_RPC11G5R) TSTBUS11 Position */
#define PPS_RPC11G5R_Msk                      _UINT32_(0x0000003F)                                 /* (PPS_RPC11G5R) Register Mask  */


/* -------- PPS_RPD0G5R : (PPS Offset: 0x3B8) (R/W 32)  -------- */
#define PPS_RPD0G5R_RESETVALUE                _UINT32_(0x00)                                       /*  (PPS_RPD0G5R)   Reset Value */

#define PPS_RPD0G5R_RPD0G5R_Pos               _UINT32_(0)                                          /* (PPS_RPD0G5R) RPD0/G5 Position */
#define PPS_RPD0G5R_RPD0G5R_Msk               (_UINT32_(0x3F) << PPS_RPD0G5R_RPD0G5R_Pos)          /* (PPS_RPD0G5R) RPD0/G5 Mask */
#define PPS_RPD0G5R_RPD0G5R(value)            (PPS_RPD0G5R_RPD0G5R_Msk & (_UINT32_(value) << PPS_RPD0G5R_RPD0G5R_Pos)) /* Assignment of value for RPD0G5R in the PPS_RPD0G5R register */
#define   PPS_RPD0G5R_RPD0G5R_OFF_Val         _UINT32_(0x0)                                        /* (PPS_RPD0G5R) OFF  */
#define   PPS_RPD0G5R_RPD0G5R_CCLO0_Val       _UINT32_(0x1)                                        /* (PPS_RPD0G5R) CCL/OUT0  */
#define   PPS_RPD0G5R_RPD0G5R_SCOM1P3_Val     _UINT32_(0x2)                                        /* (PPS_RPD0G5R) SERCOM1/PAD3  */
#define   PPS_RPD0G5R_RPD0G5R_SCOM2P0_Val     _UINT32_(0x3)                                        /* (PPS_RPD0G5R) SERCOM2/PAD0  */
#define   PPS_RPD0G5R_RPD0G5R_TCC0WO4_Val     _UINT32_(0x4)                                        /* (PPS_RPD0G5R) TCC0/WO4  */
#define   PPS_RPD0G5R_RPD0G5R_TCC0WO2_Val     _UINT32_(0x5)                                        /* (PPS_RPD0G5R) TCC0/WO2  */
#define   PPS_RPD0G5R_RPD0G5R_TCC0WO1_Val     _UINT32_(0x6)                                        /* (PPS_RPD0G5R) TCC0/WO1  */
#define   PPS_RPD0G5R_RPD0G5R_TCC1WO4_Val     _UINT32_(0x7)                                        /* (PPS_RPD0G5R) TCC1/WO4  */
#define   PPS_RPD0G5R_RPD0G5R_TCC1WO2_Val     _UINT32_(0x8)                                        /* (PPS_RPD0G5R) TCC1/WO2  */
#define   PPS_RPD0G5R_RPD0G5R_TCC1WO1_Val     _UINT32_(0x9)                                        /* (PPS_RPD0G5R) TCC1/WO1  */
#define   PPS_RPD0G5R_RPD0G5R_TC8WO1_Val      _UINT32_(0xA)                                        /* (PPS_RPD0G5R) TC8/WO1  */
#define   PPS_RPD0G5R_RPD0G5R_TC9WO1_Val      _UINT32_(0xB)                                        /* (PPS_RPD0G5R) TC9/WO1  */
#define   PPS_RPD0G5R_RPD0G5R_QSPICS_Val      _UINT32_(0xC)                                        /* (PPS_RPD0G5R) QSPI/CS  */
#define   PPS_RPD0G5R_RPD0G5R_QEICCMP0_Val    _UINT32_(0xD)                                        /* (PPS_RPD0G5R) QEI/CCMP0  */
#define   PPS_RPD0G5R_RPD0G5R_GMAC_TSUCOMP_Val _UINT32_(0xE)                                        /* (PPS_RPD0G5R) ETH/TSUCOMP  */
#define   PPS_RPD0G5R_RPD0G5R_TSTBUS3_Val     _UINT32_(0xF)                                        /* (PPS_RPD0G5R) TSTBUS3  */
#define   PPS_RPD0G5R_RPD0G5R_TSTBUS7_Val     _UINT32_(0x10)                                       /* (PPS_RPD0G5R) TSTBUS7  */
#define   PPS_RPD0G5R_RPD0G5R_TSTBUS11_Val    _UINT32_(0x11)                                       /* (PPS_RPD0G5R) TSTBUS11  */
#define PPS_RPD0G5R_RPD0G5R_OFF               (PPS_RPD0G5R_RPD0G5R_OFF_Val << PPS_RPD0G5R_RPD0G5R_Pos) /* (PPS_RPD0G5R) OFF Position */
#define PPS_RPD0G5R_RPD0G5R_CCLO0             (PPS_RPD0G5R_RPD0G5R_CCLO0_Val << PPS_RPD0G5R_RPD0G5R_Pos) /* (PPS_RPD0G5R) CCL/OUT0 Position */
#define PPS_RPD0G5R_RPD0G5R_SCOM1P3           (PPS_RPD0G5R_RPD0G5R_SCOM1P3_Val << PPS_RPD0G5R_RPD0G5R_Pos) /* (PPS_RPD0G5R) SERCOM1/PAD3 Position */
#define PPS_RPD0G5R_RPD0G5R_SCOM2P0           (PPS_RPD0G5R_RPD0G5R_SCOM2P0_Val << PPS_RPD0G5R_RPD0G5R_Pos) /* (PPS_RPD0G5R) SERCOM2/PAD0 Position */
#define PPS_RPD0G5R_RPD0G5R_TCC0WO4           (PPS_RPD0G5R_RPD0G5R_TCC0WO4_Val << PPS_RPD0G5R_RPD0G5R_Pos) /* (PPS_RPD0G5R) TCC0/WO4 Position */
#define PPS_RPD0G5R_RPD0G5R_TCC0WO2           (PPS_RPD0G5R_RPD0G5R_TCC0WO2_Val << PPS_RPD0G5R_RPD0G5R_Pos) /* (PPS_RPD0G5R) TCC0/WO2 Position */
#define PPS_RPD0G5R_RPD0G5R_TCC0WO1           (PPS_RPD0G5R_RPD0G5R_TCC0WO1_Val << PPS_RPD0G5R_RPD0G5R_Pos) /* (PPS_RPD0G5R) TCC0/WO1 Position */
#define PPS_RPD0G5R_RPD0G5R_TCC1WO4           (PPS_RPD0G5R_RPD0G5R_TCC1WO4_Val << PPS_RPD0G5R_RPD0G5R_Pos) /* (PPS_RPD0G5R) TCC1/WO4 Position */
#define PPS_RPD0G5R_RPD0G5R_TCC1WO2           (PPS_RPD0G5R_RPD0G5R_TCC1WO2_Val << PPS_RPD0G5R_RPD0G5R_Pos) /* (PPS_RPD0G5R) TCC1/WO2 Position */
#define PPS_RPD0G5R_RPD0G5R_TCC1WO1           (PPS_RPD0G5R_RPD0G5R_TCC1WO1_Val << PPS_RPD0G5R_RPD0G5R_Pos) /* (PPS_RPD0G5R) TCC1/WO1 Position */
#define PPS_RPD0G5R_RPD0G5R_TC8WO1            (PPS_RPD0G5R_RPD0G5R_TC8WO1_Val << PPS_RPD0G5R_RPD0G5R_Pos) /* (PPS_RPD0G5R) TC8/WO1 Position */
#define PPS_RPD0G5R_RPD0G5R_TC9WO1            (PPS_RPD0G5R_RPD0G5R_TC9WO1_Val << PPS_RPD0G5R_RPD0G5R_Pos) /* (PPS_RPD0G5R) TC9/WO1 Position */
#define PPS_RPD0G5R_RPD0G5R_QSPICS            (PPS_RPD0G5R_RPD0G5R_QSPICS_Val << PPS_RPD0G5R_RPD0G5R_Pos) /* (PPS_RPD0G5R) QSPI/CS Position */
#define PPS_RPD0G5R_RPD0G5R_QEICCMP0          (PPS_RPD0G5R_RPD0G5R_QEICCMP0_Val << PPS_RPD0G5R_RPD0G5R_Pos) /* (PPS_RPD0G5R) QEI/CCMP0 Position */
#define PPS_RPD0G5R_RPD0G5R_GMAC_TSUCOMP      (PPS_RPD0G5R_RPD0G5R_GMAC_TSUCOMP_Val << PPS_RPD0G5R_RPD0G5R_Pos) /* (PPS_RPD0G5R) ETH/TSUCOMP Position */
#define PPS_RPD0G5R_RPD0G5R_TSTBUS3           (PPS_RPD0G5R_RPD0G5R_TSTBUS3_Val << PPS_RPD0G5R_RPD0G5R_Pos) /* (PPS_RPD0G5R) TSTBUS3 Position */
#define PPS_RPD0G5R_RPD0G5R_TSTBUS7           (PPS_RPD0G5R_RPD0G5R_TSTBUS7_Val << PPS_RPD0G5R_RPD0G5R_Pos) /* (PPS_RPD0G5R) TSTBUS7 Position */
#define PPS_RPD0G5R_RPD0G5R_TSTBUS11          (PPS_RPD0G5R_RPD0G5R_TSTBUS11_Val << PPS_RPD0G5R_RPD0G5R_Pos) /* (PPS_RPD0G5R) TSTBUS11 Position */
#define PPS_RPD0G5R_Msk                       _UINT32_(0x0000003F)                                 /* (PPS_RPD0G5R) Register Mask  */


/* -------- PPS_RPD1G5R : (PPS Offset: 0x3BC) (R/W 32)  -------- */
#define PPS_RPD1G5R_RESETVALUE                _UINT32_(0x00)                                       /*  (PPS_RPD1G5R)   Reset Value */

